// JavaScript Document
pinyin={"1":"yī","2":"èr","3":"sān","4":"sì","5":"wǔ","6":"liù","7":"qī","8":"bā","9":"jiǔ","0":"líng","啊":"ā","阿":"ā","埃":"āi","挨":"āi","哎":"āi","唉":"āi","哀":"āi","皑":"ái","癌":"ái","蔼":"ǎi","矮":"ǎi","艾":"ài","碍":"ài","爱":"ài","隘":"ài","鞍":"ān","氨":"ān","安":"ān","俺":"ǎn","按":"àn","暗":"àn","岸":"àn","胺":"àn","案":"àn","肮":"āng","昂":"áng","盎":"àng","凹":"āo","敖":"áo","熬":"áo","翱":"áo","袄":"ǎo","傲":"ào","奥":"ào","懊":"ào","澳":"ào","芭":"bā","捌":"bā","扒":"bā","叭":"bā","吧":"bā","笆":"bā","八":"bā","疤":"bā","巴":"bā","拔":"bá","跋":"bá","靶":"bǎ","把":"bǎ","耙":"pá","坝":"bà","霸":"bà","罢":"bà","爸":"bà","白":"bái","柏":"bǎi","百":"bǎi","摆":"bǎi","佰":"bǎi","败":"bài","拜":"bài","稗":"bài","斑":"bān","班":"bān","搬":"bān","扳":"bān","般":"bān","颁":"bān","板":"bǎn","版":"bǎn","扮":"bàn","拌":"bàn","伴":"bàn","瓣":"bàn","半":"bàn","办":"bàn","绊":"bàn","邦":"bāng","帮":"bāng","梆":"bāng","榜":"bǎng","膀":"bǎng","绑":"bǎng","棒":"bàng","磅":"páng","蚌":"bàng","镑":"bàng","傍":"bàng","谤":"bàng","苞":"bāo","胞":"bāo","包":"bāo","褒":"bāo","剥":"bāo","薄":"báo","雹":"báo","保":"bǎo","堡":"bǎo","饱":"bǎo","宝":"bǎo","抱":"bào","报":"bào","暴":"bào","豹":"bào","鲍":"bào","爆":"bào","杯":"bēi","碑":"bēi","悲":"bēi","卑":"bēi","北":"běi","辈":"bèi","背":"bèi","贝":"bèi","钡":"bèi","倍":"bèi","狈":"bèi","备":"bèi","惫":"bèi","焙":"bèi","被":"bèi","奔":"bēn","苯":"běn","本":"běn","笨":"bèn","崩":"bēng","绷":"bēng","甭":"béng","泵":"bèng","蹦":"bèng","迸":"bèng","逼":"bī","鼻":"bí","比":"bǐ","鄙":"bǐ","笔":"bǐ","彼":"bǐ","碧":"bì","蓖":"bì","蔽":"bì","毕":"bì","毙":"bì","毖":"bì","币":"bì","庇":"bì","痹":"bì","闭":"bì","敝":"bì","弊":"bì","必":"bì","辟":"pì","壁":"bì","臂":"bì","避":"bì","陛":"bì","鞭":"biān","边":"biān","编":"biān","贬":"biǎn","扁":"biǎn","便":"biàn","变":"biàn","卞":"biàn","辨":"biàn","辩":"biàn","辫":"biàn","遍":"biàn","标":"biāo","彪":"biāo","膘":"biāo","表":"biǎo","鳖":"biē","憋":"biē","别":"bié","瘪":"biě","彬":"bīn","斌":"bīn","濒":"bīn","滨":"bīn","宾":"bīn","摈":"bìn","兵":"bīng","冰":"bīng","柄":"bǐng","丙":"bǐng","秉":"bǐng","饼":"bǐng","炳":"bǐng","病":"bìng","并":"bìng","玻":"bō","菠":"bō","播":"bō","拨":"bō","钵":"bō","波":"bō","博":"bó","勃":"bó","搏":"bó","铂":"bó","箔":"bó","伯":"bó","帛":"bó","舶":"bó","脖":"bó","膊":"bó","渤":"bó","泊":"bó","驳":"bó","捕":"bǔ","卜":"bo","哺":"bǔ","补":"bǔ","埠":"bù","不":"bù","布":"bù","步":"bù","簿":"bù","部":"bù","怖":"bù","擦":"cā","猜":"cāi","裁":"cái","材":"cái","才":"cái","财":"cái","睬":"cǎi","踩":"cǎi","采":"cǎi","彩":"cǎi","菜":"cài","蔡":"cài","餐":"cān","参":"cān","蚕":"cán","残":"cán","惭":"cán","惨":"cǎn","灿":"càn","苍":"cāng","舱":"cāng","仓":"cāng","沧":"cāng","藏":"cáng","操":"cāo","糙":"cāo","槽":"cáo","曹":"cáo","草":"cǎo","厕":"cè","策":"cè","侧":"cè","册":"cè","测":"cè","层":"céng","蹭":"cèng","插":"chā","叉":"chā","茬":"chá","茶":"chá","查":"chá","碴":"chá","搽":"chá","察":"chá","岔":"chà","差":"chà","诧":"chà","拆":"chāi","柴":"chái","豺":"chái","搀":"chān","掺":"chān","蝉":"chán","馋":"chán","谗":"chán","缠":"chán","铲":"chǎn","产":"chǎn","阐":"chǎn","颤":"chàn","昌":"chāng","猖":"chāng","场":"chǎng","尝":"cháng","常":"cháng","长":"cháng","偿":"cháng","肠":"cháng","厂":"chǎng","敞":"chǎng","畅":"chàng","唱":"chàng","倡":"chàng","超":"chāo","抄":"chāo","钞":"chāo","朝":"cháo","嘲":"cháo","潮":"cháo","巢":"cháo","吵":"chǎo","炒":"chǎo","车":"chē","扯":"chě","撤":"chè","掣":"chè","彻":"chè","澈":"chè","郴":"chēn","臣":"chén","辰":"chén","尘":"chén","晨":"chén","忱":"chén","沉":"chén","陈":"chén","趁":"chèn","衬":"chèn","撑":"chēng","称":"chēng","城":"chéng","橙":"chéng","成":"chéng","呈":"chéng","乘":"chéng","程":"chéng","惩":"chéng","澄":"chéng","诚":"chéng","承":"chéng","逞":"chěng","骋":"chěng","秤":"chèng","吃":"chī","痴":"chī","持":"chí","匙":"chí","池":"shi","迟":"chí","弛":"chí","驰":"chí","耻":"chǐ","齿":"chǐ","侈":"chǐ","尺":"chǐ","赤":"chì","翅":"chì","斥":"chì","炽":"chì","充":"chōng","冲":"chōng","虫":"chóng","崇":"chóng","宠":"chǒng","抽":"chōu","酬":"chóu","畴":"chóu","踌":"chóu","稠":"chóu","愁":"chóu","筹":"chóu","仇":"chóu","绸":"chóu","瞅":"chǒu","丑":"chǒu","臭":"chòu","初":"chū","出":"chū","橱":"chú","厨":"chú","躇":"chú","锄":"chú","雏":"chú","滁":"chú","除":"chú","楚":"chǔ","础":"chǔ","储":"chǔ","矗":"chù","搐":"chù","触":"chù","处":"chǔ","揣":"chuāi","川":"chuān","穿":"chuān","椽":"chuán","传":"chuán","船":"chuán","喘":"chuǎn","串":"chuàn","疮":"chuāng","窗":"chuāng","幢":"zhuàng","床":"chuáng","闯":"chuǎng","创":"chuàng","吹":"chuí","炊":"chuī","捶":"chuī","锤":"chuí","垂":"chuí","春":"chūn","椿":"chūn","醇":"chún","唇":"chún","淳":"chún","纯":"chún","蠢":"chǔn","戳":"chuō","绰":"chuō","疵":"cī","茨":"cí","磁":"cí","雌":"cí","辞":"cí","慈":"cí","瓷":"cí","词":"cí","此":"cǐ","刺":"cì","赐":"cì","次":"cì","聪":"cōng","葱":"cōng","囱":"cōng","匆":"cōng","从":"cóng","丛":"cóng","凑":"còu","粗":"cū","醋":"cù","簇":"cù","促":"cù","蹿":"cuān","篡":"cuàn","窜":"cuàn","摧":"cuī","崔":"cuī","催":"cuī","脆":"cuì","瘁":"cuì","粹":"cuì","淬":"cuì","翠":"cuì","村":"cūn","存":"cún","寸":"cùn","磋":"cuō","撮":"cuō","搓":"cuō","措":"cuò","挫":"cuò","错":"cuò","搭":"dā","达":"dá","答":"dá","瘩":"dá","打":"dǎ","大":"dà","呆":"dāi","歹":"dǎi","傣":"dǎi","戴":"dài","带":"dài","殆":"dài","代":"dài","贷":"dài","袋":"dài","待":"dài","逮":"dǎi","怠":"dài","耽":"dān","担":"dān","丹":"dān","单":"dān","郸":"dān","掸":"dǎn","胆":"dǎn","旦":"dàn","氮":"dàn","但":"dàn","惮":"dàn","淡":"dàn","诞":"dàn","弹":"dàn","蛋":"dàn","当":"dāng","挡":"dǎng","党":"dǎng","荡":"dàng","档":"dàng","刀":"dāo","捣":"dǎo","蹈":"dǎo","倒":"dǎo","岛":"dǎo","祷":"dǎo","导":"dǎo","到":"dào","稻":"dào","悼":"dào","道":"dào","盗":"dào","德":"dé","得":"dé","的":"de","蹬":"dēng","灯":"dēng","登":"dēng","等":"děng","瞪":"dèng","凳":"dèng","邓":"dèng","堤":"dī","低":"dī","滴":"dī","迪":"dī","敌":"dí","笛":"dí","狄":"dí","涤":"dí","翟":"dí","嫡":"dí","抵":"dǐ","底":"dǐ","地":"dì","蒂":"dì","第":"dì","帝":"dì","弟":"dì","递":"dì","缔":"dì","颠":"diān","掂":"diān","滇":"diān","碘":"diǎn","点":"diǎn","典":"diǎn","靛":"diàn","垫":"diàn","电":"diàn","佃":"diàn","甸":"diàn","店":"diàn","惦":"diàn","奠":"diàn","淀":"diàn","殿":"diàn","碉":"diāo","叼":"diāo","雕":"diāo","凋":"diāo","刁":"diāo","掉":"diào","吊":"diào","钓":"diào","调":"diào","跌":"diē","爹":"diē","碟":"dié","蝶":"dié","迭":"dié","谍":"dié","叠":"dié","丁":"dīng","盯":"dīng","叮":"dīng","钉":"dìng","顶":"dǐng","鼎":"dǐng","锭":"dìng","定":"dìng","订":"dìng","丢":"diu1","东":"dōng","冬":"dōng","董":"dǒng","懂":"dǒng","动":"dòng","栋":"dòng","侗":"dòng","恫":"dòng","冻":"dòng","洞":"dòng","兜":"dōu","抖":"dǒu","斗":"dòu","陡":"dǒu","豆":"dòu","逗":"dòu","痘":"dòu","都":"dōu","督":"dū","毒":"dú","犊":"dú","独":"dú","读":"dú","堵":"dǔ","睹":"dǔ","赌":"dǔ","杜":"dù","镀":"dù","肚":"dù","度":"dù","渡":"dù","妒":"dù","端":"duān","短":"duǎn","锻":"duàn","段":"duàn","断":"duàn","缎":"duàn","堆":"duī","兑":"duì","队":"duì","对":"duì","墩":"dūn","吨":"dūn","蹲":"dūn","敦":"dūn","顿":"dùn","囤":"dùn","钝":"dùn","盾":"dùn","遁":"dùn","掇":"duō","哆":"duō","多":"duō","夺":"duó","垛":"duǒ","躲":"duǒ","朵":"duǒ","跺":"duò","舵":"duò","剁":"duò","惰":"duò","堕":"duò","蛾":"é","峨":"é","鹅":"é","俄":"é","额":"é","讹":"é","娥":"é","恶":"è","厄":"è","扼":"è","遏":"è","鄂":"è","饿":"è","恩":"ēn","而":"ér","儿":"ér","耳":"ěr","尔":"ěr","饵":"ěr","洱":"ěr","二":"èr","贰":"èr","发":"fā","罚":"fá","筏":"fá","伐":"fá","乏":"fá","阀":"fá","法":"fǎ","珐":"fà","藩":"fān","帆":"fān","番":"fān","翻":"fān","樊":"fán","矾":"fán","钒":"fán","繁":"fán","凡":"fán","烦":"fán","反":"fǎn","返":"fǎn","范":"fàn","贩":"fàn","犯":"fàn","饭":"fàn","泛":"fàn","坊":"fāng","芳":"fāng","方":"fāng","肪":"fáng","房":"fáng","防":"fáng","妨":"fáng","仿":"fǎng","访":"fǎng","纺":"fǎng","放":"fàng","菲":"fēi","非":"fēi","啡":"fēi","飞":"fēi","肥":"féi","匪":"fěi","诽":"fěi","吠":"fèi","肺":"fèi","废":"fèi","沸":"fèi","费":"fèi","芬":"fēn","酚":"fēn","吩":"fēn","氛":"fēn","分":"fēn","纷":"fēn","坟":"fén","焚":"fén","汾":"fén","粉":"fěn","奋":"fèn","份":"fèn","忿":"fèn","愤":"fèn","粪":"fèn","丰":"fēng","封":"fēng","枫":"fēng","蜂":"fēng","峰":"fēng","锋":"fēng","风":"fēng","疯":"fēng","烽":"fēng","逢":"féng","冯":"féng","缝":"féng","讽":"fěng","奉":"fèng","凤":"fèng","佛":"fó","否":"fǒu","夫":"fū","敷":"fū","肤":"fū","孵":"fū","扶":"fú","拂":"fú","辐":"fú","幅":"fú","氟":"fú","符":"fú","伏":"fú","俘":"fú","服":"fú","浮":"fú","涪":"fú","福":"fú","袱":"fú","弗":"fú","甫":"fǔ","抚":"fǔ","辅":"fǔ","俯":"fǔ","釜":"fǔ","斧":"fǔ","脯":"pú","腑":"fǔ","府":"fǔ","腐":"fǔ","赴":"fù","副":"fù","覆":"fù","赋":"fù","复":"fù","傅":"fù","付":"fù","阜":"fù","父":"fù","腹":"fù","负":"fù","富":"fù","讣":"fù","附":"fù","妇":"fù","缚":"fù","咐":"fù","噶":"gá","嘎":"gā","该":"gāi","改":"gǎi","概":"gài","钙":"gài","盖":"gài","溉":"gài","干":"gàn","甘":"gān","杆":"gǎn","柑":"gān","竿":"gān","肝":"gān","赶":"gǎn","感":"gǎn","秆":"gǎn","敢":"gǎn","赣":"gàn","冈":"gāng","刚":"gāng","钢":"gāng","缸":"gāng","肛":"gāng","纲":"gāng","岗":"gǎng","港":"gǎng","杠":"gàng","篙":"gāo","皋":"gāo","高":"gāo","膏":"gāo","羔":"gāo","糕":"gāo","搞":"gǎo","镐":"gǎo","稿":"gǎo","告":"gào","哥":"gē","歌":"gē","搁":"gē","戈":"gē","鸽":"gē","胳":"gē","疙":"gē","割":"gē","革":"gé","葛":"gě","格":"gé","蛤":"há","阁":"gé","隔":"gé","铬":"gè","个":"gè","各":"gè","给":"gěi","根":"gēn","跟":"gēn","耕":"gēng","更":"gèng","庚":"gēng","羹":"gēng","埂":"gěng","耿":"gěng","梗":"gěng","工":"gōng","攻":"gōng","功":"gōng","恭":"gōng","龚":"gōng","供":"gòng","躬":"gōng","公":"gōng","宫":"gōng","弓":"gōng","巩":"gǒng","汞":"gǒng","拱":"gǒng","贡":"gòng","共":"gòng","钩":"gōu","勾":"gōu","沟":"gōu","苟":"gǒu","狗":"gǒu","垢":"gòu","构":"gòu","购":"gòu","够":"gòu","辜":"gū","菇":"gū","咕":"gū","箍":"gū","估":"gū","沽":"gū","孤":"gū","姑":"gū","鼓":"gǔ","古":"gǔ","蛊":"gǔ","骨":"gǔ","谷":"gǔ","股":"gǔ","故":"gù","顾":"gù","固":"gù","雇":"gù","刮":"guā","瓜":"guā","剐":"guǎ","寡":"guǎ","挂":"guà","褂":"guà","乖":"guāi","拐":"guǎi","怪":"guài","棺":"guān","关":"guān","官":"guān","冠":"guàn","观":"guān","管":"guǎn","馆":"guǎn","罐":"guàn","惯":"guàn","灌":"guàn","贯":"guàn","光":"guāng","广":"guǎng","逛":"guàng","瑰":"guī","规":"guī","圭":"guī","硅":"guī","归":"guī","龟":"guī","闺":"guī","轨":"guǐ","鬼":"guǐ","诡":"guǐ","癸":"guǐ","桂":"guì","柜":"guì","跪":"guì","贵":"guì","刽":"guì","辊":"gǔn","滚":"gǔn","棍":"gùn","锅":"guō","郭":"guō","国":"guó","果":"guǒ","裹":"guǒ","过":"guò","哈":"hā","骸":"hái","孩":"hái","海":"hǎi","氦":"hài","亥":"hài","害":"hài","骇":"hài","酣":"hān","憨":"hān","邯":"hán","韩":"hán","含":"hán","涵":"hán","寒":"hán","函":"hán","喊":"hǎn","罕":"hǎn","翰":"hàn","撼":"hàn","捍":"hàn","旱":"hàn","憾":"hàn","悍":"hàn","焊":"hàn","汗":"hàn","汉":"hàn","夯":"hāng","杭":"háng","航":"háng","壕":"háo","嚎":"háo","豪":"háo","毫":"háo","郝":"hǎo","好":"hǎo","耗":"hào","号":"hào","浩":"hào","呵":"hē","喝":"hē","荷":"hé","菏":"hé","核":"hé","禾":"hé","和":"hé","何":"hé","合":"hé","盒":"hé","貉":"hè","阂":"hé","河":"hé","涸":"hé","赫":"hè","褐":"hè","鹤":"hè","贺":"hè","嘿":"hēi","黑":"hēi","痕":"hén","很":"hěn","狠":"hěn","恨":"hèn","哼":"hēng","亨":"hēng","横":"héng","衡":"héng","恒":"héng","轰":"hōng","哄":"hǒng","烘":"hōng","虹":"hóng","鸿":"hóng","洪":"hóng","宏":"hóng","弘":"hóng","红":"hóng","喉":"hóu","侯":"hòu","猴":"hóu","吼":"hǒu","厚":"hòu","候":"hòu","后":"hòu","呼":"hū","乎":"hū","忽":"hū","瑚":"hú","壶":"hú","葫":"hú","胡":"hú","蝴":"hú","狐":"hú","糊":"hú","湖":"hú","弧":"hú","虎":"hǔ","唬":"hǔ","护":"hù","互":"hù","沪":"hù","户":"hù","花":"huā","哗":"huá","华":"huá","猾":"huá","滑":"huá","画":"huà","划":"huá","化":"huà","话":"huà","槐":"huái","徊":"huái","怀":"huái","淮":"huái","坏":"huài","欢":"huān","环":"huán","桓":"huán","还":"hái","缓":"huǎn","换":"huàn","患":"huàn","唤":"huàn","痪":"huàn","豢":"huàn","焕":"huàn","涣":"huàn","宦":"huàn","幻":"huàn","荒":"huāng","慌":"huāng","黄":"huáng","磺":"huáng","蝗":"huáng","簧":"huáng","皇":"huáng","凰":"huáng","惶":"huáng","煌":"huáng","晃":"huàng","幌":"huǎng","恍":"huǎng","谎":"huǎng","灰":"huī","挥":"huī","辉":"huī","徽":"huī","恢":"huī","蛔":"huí","回":"huí","毁":"huǐ","悔":"huǐ","慧":"huì","卉":"huì","惠":"huì","晦":"huì","贿":"huì","秽":"huì","会":"huì","烩":"huì","汇":"huì","讳":"huì","诲":"huì","绘":"huì","荤":"hūn","昏":"hūn","婚":"hūn","魂":"hún","浑":"hún","混":"hùn","豁":"huō","活":"huó","伙":"huǒ","火":"huǒ","获":"huò","或":"huò","惑":"huò","霍":"huò","货":"huò","祸":"huò","击":"jī","圾":"jī","基":"jī","机":"jī","畸":"jī","稽":"jī","积":"jī","箕":"jī","肌":"jī","饥":"jī","迹":"jì","激":"jī","讥":"jī","鸡":"jī","姬":"jī","绩":"jì","缉":"jī","吉":"jí","极":"jí","棘":"jí","辑":"jí","籍":"jí","集":"jí","及":"jí","急":"jí","疾":"jí","汲":"jí","即":"jí","嫉":"jí","级":"jí","挤":"jǐ","几":"jǐ","脊":"jǐ","己":"jǐ","蓟":"jì","技":"jì","冀":"jì","季":"jì","伎":"jì","祭":"jì","剂":"jì","悸":"jì","济":"jì","寄":"jì","寂":"jì","计":"jì","记":"jì","既":"jì","忌":"jì","际":"jì","妓":"jì","继":"jì","纪":"jì","嘉":"jiā","枷":"jiā","夹":"jiā","佳":"jiā","家":"jiā","加":"jiā","荚":"jiá","颊":"jiá","贾":"jiǎ","甲":"jiǎ","钾":"jiǎ","假":"jiǎ","稼":"jià","价":"jià","架":"jià","驾":"jià","嫁":"jià","歼":"jiān","监":"jiān","坚":"jiān","尖":"jiān","笺":"jiān","间":"jiān","煎":"jiān","兼":"jiān","肩":"jiān","艰":"jiān","奸":"jiān","缄":"jiān","茧":"jiǎn","检":"jiǎn","柬":"jiǎn","碱":"jiǎn","硷":"jiǎn","拣":"jiǎn","捡":"jiǎn","简":"jiǎn","俭":"jiǎn","剪":"jiǎn","减":"jiǎn","荐":"jiàn","槛":"kǎn","鉴":"jiàn","践":"jiàn","贱":"jiàn","见":"jiàn","键":"jiàn","箭":"jiàn","件":"jiàn","健":"jiàn","舰":"jiàn","剑":"jiàn","饯":"jiàn","渐":"jiàn","溅":"jiàn","涧":"jiàn","建":"jiàn","僵":"jiāng","姜":"jiāng","将":"jiāng","浆":"jiāng","江":"jiāng","疆":"jiāng","蒋":"jiǎng","桨":"jiǎng","奖":"jiǎng","讲":"jiǎng","匠":"jiàng","酱":"jiàng","降":"jiàng","蕉":"jiāo","椒":"jiāo","礁":"jiāo","焦":"jiāo","胶":"jiāo","交":"jiāo","郊":"jiāo","浇":"jiāo","骄":"jiāo","娇":"jiāo","嚼":"jiáo","搅":"jiǎo","铰":"jiǎo","矫":"jiǎo","侥":"yáo","脚":"jiǎo","狡":"jiǎo","角":"jiǎo","饺":"jiǎo","缴":"jiǎo","绞":"jiǎo","剿":"jiǎo","教":"jiào","酵":"jiào","轿":"jiào","较":"jiào","叫":"jiào","窖":"jiào","揭":"jiē","接":"jiē","皆":"jiē","秸":"jiē","街":"jiē","阶":"jiē","截":"jié","劫":"jié","节":"jié","桔":"jú","杰":"jié","捷":"jié","睫":"jié","竭":"jié","洁":"jié","结":"jié","解":"jiě","姐":"jiě","戒":"jiè","藉":"jiè","芥":"jiè","界":"jiè","借":"jiè","介":"jiè","疥":"jiè","诫":"jiè","届":"jiè","巾":"jīn","筋":"jīn","斤":"jīn","金":"jīn","今":"jīn","津":"jīn","襟":"jīn","紧":"jǐn","锦":"jǐn","仅":"jǐn","谨":"jǐn","进":"jìn","靳":"jìn","晋":"jìn","禁":"jìn","近":"jìn","烬":"jìn","浸":"jìn","尽":"jìn","劲":"jìn","荆":"jīng","兢":"jīng","茎":"jīng","睛":"jīng","晶":"jīng","鲸":"jīng","京":"jīng","惊":"jīng","精":"jīng","粳":"jīng","经":"jīng","井":"jǐng","警":"jǐng","景":"jǐng","颈":"jǐng","静":"jìng","境":"jìng","敬":"jìng","镜":"jìng","径":"jìng","痉":"jìng","靖":"jìng","竟":"jìng","竞":"jìng","净":"jìng","炯":"jiǒng","窘":"jiǒng","揪":"jiū","究":"jiū","纠":"jiū","玖":"jiǔ","韭":"jiǔ","久":"jiǔ","灸":"jiǔ","九":"jiǔ","酒":"jiǔ","厩":"jiù","救":"jiù","旧":"jiù","臼":"jiù","舅":"jiù","咎":"jiù","就":"jiù","疚":"jiù","鞠":"jū","拘":"jū","狙":"jū","疽":"jū","居":"jū","驹":"jū","菊":"jú","局":"jú","咀":"jǔ","矩":"jǔ","举":"jǔ","沮":"jǔ","聚":"jù","拒":"jù","据":"jù","巨":"jù","具":"jù","距":"jù","踞":"jù","锯":"jù","俱":"jù","句":"jù","惧":"jù","炬":"jù","剧":"jù","捐":"juān","鹃":"juān","娟":"juān","倦":"juàn","眷":"juàn","卷":"juàn","绢":"juàn","撅":"juē","攫":"jué","抉":"jué","掘":"jué","倔":"juè","爵":"jué","觉":"jué","决":"jué","诀":"jué","绝":"jué","均":"jūn","菌":"jūn","钧":"jūn","军":"jūn","君":"jūn","峻":"jùn","俊":"jùn","竣":"jùn","浚":"xùn","郡":"jùn","骏":"jùn","喀":"kā","咖":"kā","卡":"kǎ","咯":"gē","开":"kāi","揩":"kāi","楷":"kǎi","凯":"kǎi","慨":"kǎi","刊":"kān","堪":"kān","勘":"kān","坎":"kǎn","砍":"kǎn","看":"kàn","康":"kāng","慷":"kāng","糠":"kāng","扛":"káng","抗":"kàng","亢":"kàng","炕":"kàng","考":"kǎo","拷":"kǎo","烤":"kǎo","靠":"kào","坷":"kě","苛":"kē","柯":"kē","棵":"kē","磕":"kē","颗":"kē","科":"kē","壳":"ké","咳":"ké","可":"kě","渴":"kě","克":"kè","刻":"kè","客":"kè","课":"kè","肯":"kěn","啃":"kěn","垦":"kěn","恳":"kěn","坑":"kēng","吭":"kēng","空":"kōng","恐":"kǒng","孔":"kǒng","控":"kòng","抠":"kōu","口":"kǒu","扣":"kòu","寇":"kòu","枯":"kū","哭":"kū","窟":"kū","苦":"kǔ","酷":"kù","库":"kù","裤":"kù","夸":"kuā","垮":"kuǎ","挎":"kuà","跨":"kuà","胯":"kuà","块":"kuài","筷":"kuài","侩":"kuài","快":"kuài","宽":"kuān","款":"kuǎn","匡":"kuāng","筐":"kuāng","狂":"kuáng","框":"kuàng","矿":"kuàng","眶":"kuàng","旷":"kuàng","况":"kuàng","亏":"kuī","盔":"kuī","岿":"kuī","窥":"kuī","葵":"kuí","奎":"kuí","魁":"kuí","傀":"guī","馈":"kuì","愧":"kuì","溃":"kuì","坤":"kūn","昆":"kūn","捆":"kǔn","困":"kùn","括":"kuò","扩":"kuò","廓":"kuò","阔":"kuò","垃":"lā","拉":"lā","喇":"lǎ","蜡":"là","腊":"là","辣":"là","啦":"lā","莱":"lái","来":"lái","赖":"lài","蓝":"lán","婪":"lán","栏":"lán","拦":"lán","篮":"lán","阑":"lán","兰":"lán","澜":"lán","谰":"lán","揽":"lǎn","览":"lǎn","懒":"lǎn","缆":"lǎn","烂":"làn","滥":"làn","琅":"láng","榔":"láng","狼":"láng","廊":"láng","郎":"láng","朗":"lǎng","浪":"làng","捞":"lāo","劳":"láo","牢":"láo","老":"lǎo","佬":"lǎo","姥":"lǎo","酪":"lào","烙":"lào","涝":"lào","勒":"lè","乐":"lè","雷":"léi","镭":"léi","蕾":"lěi","磊":"lěi","累":"lèi","儡":"lěi","垒":"lěi","擂":"lèi","肋":"lèi","类":"lèi","泪":"lèi","棱":"léng","楞":"léng","冷":"lěng","厘":"lí","梨":"lí","犁":"lí","黎":"lí","篱":"lí","狸":"lí","离":"lí","漓":"lí","理":"lǐ","李":"lǐ","里":"lǐ","鲤":"lǐ","礼":"lǐ","莉":"lì","荔":"lì","吏":"lì","栗":"lì","丽":"lì","厉":"lì","励":"lì","砾":"lì","历":"lì","利":"lì","傈":"lì","例":"lì","俐":"lì","痢":"lì","立":"lì","粒":"lì","沥":"lì","隶":"lì","力":"lì","璃":"lí","哩":"lǐ","俩":"liǎng","联":"lián","莲":"lián","连":"lián","镰":"lián","廉":"lián","怜":"lián","涟":"lián","帘":"lián","敛":"liǎn","脸":"liǎn","链":"liàn","恋":"liàn","炼":"liàn","练":"liàn","粮":"liáng","凉":"liáng","梁":"liáng","粱":"liáng","良":"liáng","两":"liǎng","辆":"liàng","量":"liàng","晾":"liàng","亮":"liàng","谅":"liàng","撩":"liáo","聊":"liáo","僚":"liáo","疗":"liáo","燎":"liáo","寥":"liáo","辽":"liáo","潦":"liáo","了":"le","撂":"liào","镣":"liào","廖":"liào","料":"liào","列":"liè","裂":"liè","烈":"liè","劣":"liè","猎":"liè","琳":"lín","林":"lín","磷":"lín","霖":"lín","临":"lín","邻":"lín","鳞":"lín","淋":"lín","凛":"lǐn","赁":"lìn","吝":"lìn","拎":"līn","玲":"líng","菱":"líng","零":"líng","龄":"líng","铃":"líng","伶":"líng","羚":"líng","凌":"líng","灵":"líng","陵":"líng","岭":"lǐng","领":"lǐng","另":"lìng","令":"lìng","溜":"liū","琉":"liú","榴":"liú","硫":"liú","馏":"liú","留":"liú","刘":"liú","瘤":"liú","流":"liú","柳":"liǔ","六":"liù","龙":"lóng","聋":"lóng","咙":"lóng","笼":"lóng","窿":"lóng","隆":"lóng","垄":"lǒng","拢":"lǒng","陇":"lǒng","楼":"lóu","娄":"lóu","搂":"lǒu","篓":"lǒu","漏":"lòu","陋":"lòu","芦":"lú","卢":"lú","颅":"lú","庐":"lú","炉":"lú","掳":"lǔ","卤":"lǔ","虏":"lǔ","鲁":"lǔ","麓":"lù","碌":"lù","露":"lù","路":"lù","赂":"lù","鹿":"lù","潞":"lù","禄":"lù","录":"lù","陆":"lù","戮":"lù","驴":"lǘ","吕":"lǚ","铝":"lǚ","侣":"lǚ","旅":"lǚ","履":"lǚ","屡":"lǚ","缕":"lǚ","虑":"lǜ","氯":"lǜ","律":"lǜ","率":"lǜ","滤":"lǜ","绿":"lǜ","峦":"luán","挛":"luán","孪":"luán","滦":"luán","卵":"luǎn","乱":"luàn","掠":"lüě","略":"lüè","抡":"lún","轮":"lún","伦":"lún","仑":"lún","沦":"lún","纶":"lún","论":"lùn","萝":"luó","螺":"luó","罗":"luó","逻":"luó","锣":"luó","箩":"luó","骡":"luó","裸":"luǒ","落":"luò","洛":"luò","骆":"luò","络":"luò","妈":"mā","麻":"má","玛":"mǎ","码":"mǎ","蚂":"mǎ","马":"mǎ","骂":"mà","嘛":"ma","吗":"ma","埋":"mái","买":"mǎi","麦":"mài","卖":"mài","迈":"mài","脉":"mài","瞒":"mán","馒":"mán","蛮":"mán","满":"mǎn","蔓":"màn","曼":"màn","慢":"màn","漫":"màn","谩":"màn","芒":"máng","茫":"máng","盲":"máng","氓":"máng","忙":"máng","莽":"mǎng","猫":"māo","茅":"máo","锚":"máo","毛":"máo","矛":"máo","铆":"mǎo","卯":"mǎo","茂":"mào","冒":"mào","帽":"mào","貌":"mào","贸":"mào","么":"me","玫":"méi","枚":"méi","梅":"méi","酶":"méi","霉":"méi","煤":"méi","没":"méi","眉":"méi","媒":"méi","镁":"měi","每":"měi","美":"měi","昧":"mèi","寐":"mèi","妹":"mèi","媚":"mèi","门":"mén","闷":"mèn","们":"mén","萌":"méng","蒙":"méng","檬":"méng","盟":"méng","锰":"měng","猛":"měng","梦":"mèng","孟":"mèng","眯":"mī","醚":"mí","靡":"mí","糜":"mí","迷":"mí","谜":"mí","弥":"mí","米":"mǐ","秘":"mì","觅":"mì","泌":"mì","蜜":"mì","密":"mì","幂":"mì","棉":"mián","眠":"mián","绵":"mián","冕":"miǎn","免":"miǎn","勉":"miǎn","娩":"miǎn","缅":"miǎn","面":"miàn","苗":"miáo","描":"miáo","瞄":"miáo","藐":"miǎo","秒":"miǎo","渺":"miǎo","庙":"miào","妙":"miào","蔑":"miè","灭":"miè","民":"mín","抿":"mǐn","皿":"mǐn","敏":"mǐn","悯":"mǐn","闽":"mǐn","明":"míng","螟":"míng","鸣":"míng","铭":"míng","名":"míng","命":"mìng","谬":"miù","摸":"mō","摹":"mó","蘑":"mó","模":"mó","膜":"mó","磨":"mó","摩":"mó","魔":"mó","抹":"mò","末":"mò","莫":"mò","墨":"mò","默":"mò","沫":"mò","漠":"mò","寞":"mò","陌":"mò","谋":"móu","牟":"móu","某":"mǒu","拇":"mǔ","牡":"mǔ","亩":"mǔ","姆":"mǔ","母":"mǔ","墓":"mù","暮":"mù","幕":"mù","募":"mù","慕":"mù","木":"mù","目":"mù","睦":"mù","牧":"mù","穆":"mù","拿":"ná","哪":"nǎ","呐":"nà","钠":"nà","那":"nà","娜":"nà","纳":"nà","氖":"nǎi","乃":"nǎi","奶":"nǎi","耐":"nai","奈":"nai","南":"nán","男":"nán","难":"nán","囊":"náng","挠":"náo","脑":"nǎo","恼":"nǎo","闹":"nào","淖":"nào","呢":"ne","馁":"něi","内":"nèi","嫩":"nèn","能":"néng","妮":"nī","霓":"ní","倪":"ní","泥":"ní","尼":"ní","拟":"nǐ","你":"nǐ","匿":"nì","腻":"nì","逆":"nì","溺":"nì","蔫":"niān","拈":"niān","年":"nián","碾":"niǎn","撵":"niǎn","捻":"niǎn","念":"niàn","娘":"niáng","酿":"niàng","鸟":"niǎo","尿":"niào","捏":"niē","聂":"niè","孽":"niè","啮":"niè","镊":"niè","镍":"niè","涅":"niè","您":"nín","柠":"níng","狞":"níng","凝":"níng","宁":"níng","拧":"nǐng","泞":"nìng","牛":"niú","扭":"niǔ","钮":"niǔ","纽":"niǔ","脓":"nóng","浓":"nóng","农":"nóng","弄":"nòng","奴":"nú","努":"nǔ","怒":"nù","女":"nǚ","暖":"nuǎn","虐":"nüè","疟":"nüè","挪":"nuó","懦":"nuò","糯":"nuò","诺":"nuò","哦":"ò","欧":"ōu","鸥":"ōu","殴":"ōu","藕":"ǒu","呕":"ǒu","偶":"ǒu","沤":"ōu","啪":"pā","趴":"pā","爬":"pá","帕":"pà","怕":"pà","琶":"pá","拍":"pāi","排":"pái","牌":"pái","徘":"pái","湃":"pai","派":"pai","攀":"pān","潘":"pān","盘":"pán","磐":"pán","盼":"pàn","畔":"pàn","判":"pàn","叛":"pàn","乓":"pāng","庞":"páng","旁":"páng","耪":"pǎng","胖":"pàng","抛":"pāo","咆":"páo","刨":"páo","炮":"pào","袍":"páo","跑":"pǎo","泡":"pào","呸":"pēi","胚":"pēi","培":"péi","裴":"péi","赔":"péi","陪":"péi","配":"pèi","佩":"pèi","沛":"pèi","喷":"pēn","盆":"pén","砰":"pēng","抨":"pēng","烹":"pēng","澎":"péng","彭":"péng","蓬":"péng","棚":"péng","硼":"péng","篷":"péng","膨":"péng","朋":"péng","鹏":"péng","捧":"pěng","碰":"pèng","坯":"pī","砒":"pī","霹":"pī","批":"pī","披":"pī","劈":"pī","琵":"pí","毗":"pí","啤":"pí","脾":"pí","疲":"pí","皮":"pí","匹":"pǐ","痞":"pǐ","僻":"pì","屁":"pì","譬":"pì","篇":"piān","偏":"piān","片":"piàn","骗":"piàn","飘":"piāo","漂":"piāo","瓢":"piáo","票":"piào","撇":"piě","瞥":"piē","拼":"pīn","频":"pín","贫":"pín","品":"pǐn","聘":"pìn","乒":"pīng","坪":"píng","苹":"píng","萍":"píng","平":"píng","凭":"píng","瓶":"píng","评":"píng","屏":"píng","坡":"pō","泼":"pō","颇":"pō","婆":"pó","破":"pò","魄":"pò","迫":"pò","粕":"pò","剖":"pōu","扑":"pū","铺":"pù","仆":"pú","莆":"pú","葡":"pú","菩":"pú","蒲":"pú","埔":"pǔ","朴":"pǔ","圃":"pǔ","普":"pǔ","浦":"pǔ","谱":"pǔ","曝":"pù","瀑":"bào","期":"qī","欺":"qī","栖":"qī","戚":"qī","妻":"qī","七":"qī","凄":"qī","漆":"qī","柒":"qī","沏":"qī","其":"qí","棋":"qí","奇":"qí","歧":"qí","畦":"qí","崎":"qí","脐":"qí","齐":"qí","旗":"qí","祈":"qí","祁":"qí","骑":"qí","起":"qǐ","岂":"qǐ","乞":"qǐ","企":"qǐ","启":"qǐ","契":"qì","砌":"qì","器":"qì","气":"qì","迄":"qì","弃":"qì","汽":"qì","泣":"qì","讫":"qì","掐":"qiā","恰":"qià","洽":"qià","牵":"qiān","扦":"qiān","钎":"qiān","铅":"qiān","千":"qiān","迁":"qiān","签":"qiān","仟":"qiān","谦":"qiān","乾":"qián","黔":"qián","钱":"qián","钳":"qián","前":"qián","潜":"qián","遣":"qiǎn","浅":"qiǎn","谴":"qiǎn","堑":"qiàn","嵌":"qiàn","欠":"qiàn","歉":"qiàn","枪":"qiāng","呛":"qiàng","腔":"qiāng","羌":"qiāng","墙":"qiáng","蔷":"qiáng","强":"qiáng","抢":"qiǎng","橇":"qiāo","锹":"qiāo","敲":"qiāo","悄":"qiāo","桥":"qiáo","瞧":"qiáo","乔":"qiáo","侨":"qiáo","巧":"qiǎo","鞘":"qiào","撬":"qiào","翘":"qiào","峭":"qiào","俏":"qiào","窍":"qiào","切":"qiē","茄":"qié","且":"qiě","怯":"qiè","窃":"qiè","钦":"qīn","侵":"qīn","亲":"qīn","秦":"qín","琴":"qín","勤":"qín","芹":"qín","擒":"qín","禽":"qín","寝":"qǐn","沁":"qìn","青":"qīng","轻":"qīng","氢":"qīng","倾":"qīng","卿":"qīng","清":"qīng","擎":"qíng","晴":"qíng","氰":"qíng","情":"qíng","顷":"qǐng","请":"qǐng","庆":"qìng","琼":"qióng","穷":"qióng","秋":"qiū","丘":"qiū","邱":"qiū","球":"qiú","求":"qiú","囚":"qiú","酋":"qiú","泅":"qiú","趋":"qū","区":"qū","蛆":"qū","曲":"qǔ","躯":"qū","屈":"qū","驱":"qū","渠":"qú","取":"qǔ","娶":"qǔ","龋":"qǔ","趣":"qù","去":"qù","圈":"quān","颧":"quán","权":"quán","醛":"quán","泉":"quán","全":"quán","痊":"quán","拳":"quán","犬":"quǎn","券":"quàn","劝":"quàn","缺":"quē","炔":"quē","瘸":"qué","却":"què","鹊":"què","榷":"què","确":"què","雀":"què","裙":"qún","群":"qún","然":"rán","燃":"rán","冉":"rǎn","染":"rǎn","瓤":"ráng","壤":"rǎng","攘":"rǎng","嚷":"rǎng","让":"ràng","饶":"ráo","扰":"rǎo","绕":"rào","惹":"rě","热":"rè","壬":"rén","仁":"rén","人":"rén","忍":"rěn","韧":"rèn","任":"rèn","认":"rèn","刃":"rèn","妊":"rèn","纫":"rèn","扔":"rēng","仍":"réng","日":"rì","戎":"róng","茸":"róng","蓉":"róng","荣":"róng","融":"róng","熔":"róng","溶":"róng","容":"róng","绒":"róng","冗":"rǒng","揉":"róu","柔":"róu","肉":"ròu","茹":"rú","蠕":"rú","儒":"rú","孺":"rú","如":"rú","辱":"rǔ","乳":"rǔ","汝":"rǔ","入":"rù","褥":"rù","软":"ruǎn","阮":"ruǎn","蕊":"ruǐ","瑞":"ruì","锐":"ruì","闰":"rùn","润":"rùn","若":"ruò","弱":"ruò","撒":"sā","洒":"sǎ","萨":"sà","腮":"sāi","鳃":"sāi","塞":"sāi","赛":"sài","三":"sān","叁":"sān","伞":"sǎn","散":"sàn","桑":"sāng","嗓":"sǎng","丧":"sàng","搔":"sāo","骚":"sāo","扫":"sǎo","嫂":"sǎo","瑟":"sè","色":"sè","涩":"sè","森":"sēn","僧":"sēng","莎":"shā","砂":"shā","杀":"shā","刹":"shā","沙":"shā","纱":"shā","傻":"shǎ","啥":"shá","煞":"shà","筛":"shāi","晒":"shai","珊":"shān","苫":"shān","杉":"shān","山":"shān","删":"shān","煽":"shān","衫":"shān","闪":"shǎn","陕":"shǎn","擅":"shàn","赡":"shàn","膳":"shàn","善":"shàn","汕":"shàn","扇":"shàn","缮":"shàn","墒":"shāng","伤":"shāng","商":"shāng","赏":"shǎng","晌":"shǎng","上":"shàng","尚":"shàng","裳":"shang","梢":"shāo","捎":"shāo","稍":"shāo","烧":"shāo","芍":"sháo","勺":"sháo","韶":"sháo","少":"shǎo","哨":"shào","邵":"shào","绍":"shào","奢":"shē","赊":"shē","蛇":"shé","舌":"shé","舍":"shě","赦":"shè","摄":"shè","射":"shè","慑":"shè","涉":"shè","社":"shè","设":"shè","砷":"shēn","申":"shēn","呻":"shēn","伸":"shēn","身":"shēn","深":"shēn","娠":"shēn","绅":"shēn","神":"shén","沈":"shěn","审":"shěn","婶":"shěn","甚":"shèn","肾":"shèn","慎":"shèn","渗":"shèn","声":"shēng","生":"shēng","甥":"shēng","牲":"shēng","升":"shēng","绳":"shéng","省":"shěng","盛":"shèng","剩":"shèng","胜":"shèng","圣":"shèng","师":"shī","失":"shī","狮":"shī","施":"shī","湿":"shī","诗":"shī","尸":"shī","虱":"shī","十":"shí","石":"shí","拾":"shí","时":"shí","什":"shí","食":"shí","蚀":"shí","实":"shí","识":"shí","史":"shǐ","矢":"shǐ","使":"shǐ","屎":"shǐ","驶":"shǐ","始":"shǐ","式":"shì","示":"shì","士":"shì","世":"shì","柿":"shì","事":"shì","拭":"shì","誓":"shì","逝":"shì","势":"shì","是":"shì","嗜":"shì","噬":"shì","适":"shì","仕":"shì","侍":"shì","释":"shì","饰":"shì","氏":"shì","市":"shì","恃":"shì","室":"shì","视":"shì","试":"shì","收":"shōu","手":"shǒu","首":"shǒu","守":"shǒu","寿":"shòu","授":"shòu","售":"shòu","受":"shòu","瘦":"shòu","兽":"shòu","蔬":"shū","枢":"shū","梳":"shū","殊":"shū","抒":"shū","输":"shū","叔":"shū","舒":"shū","淑":"shū","疏":"shū","书":"shū","赎":"shú","孰":"shú","熟":"shú","薯":"shǔ","暑":"shǔ","曙":"shǔ","署":"shǔ","蜀":"shǔ","黍":"shǔ","鼠":"shǔ","属":"shǔ","术":"shù","述":"shù","树":"shù","束":"shù","戍":"shù","竖":"shù","墅":"shù","庶":"shù","数":"shù","漱":"shù","恕":"shù","刷":"shuā","耍":"shuǎ","摔":"shuāi","衰":"shuāi","甩":"shuǎi","帅":"shuài","栓":"shuān","拴":"shuān","霜":"shuāng","双":"shuāng","爽":"shuǎng","谁":"shuí","水":"shuǐ","睡":"shuì","税":"shuì","吮":"shǔn","瞬":"shùn","顺":"shùn","舜":"shùn","说":"shuō","硕":"shuò","朔":"shuò","烁":"shuò","斯":"sī","撕":"sī","嘶":"sī","思":"sī","私":"sī","司":"sī","丝":"sī","死":"sǐ","肆":"sì","寺":"sì","嗣":"sì","四":"sì","伺":"sì","似":"sì","饲":"sì","巳":"sì","松":"sōng","耸":"sǒng","怂":"sǒng","颂":"sòng","送":"sòng","宋":"sòng","讼":"sòng","诵":"sòng","搜":"sōu","艘":"sōu","擞":"sǒu","嗽":"sòu","苏":"sū","酥":"sū","俗":"sú","素":"sù","速":"sù","粟":"sù","僳":"sù","塑":"sù","溯":"sù","宿":"xiǔ","诉":"sù","肃":"sù","酸":"suān","蒜":"suàn","算":"suàn","虽":"suī","隋":"suí","随":"suí","绥":"suí","髓":"suǐ","碎":"suì","岁":"suì","穗":"suì","遂":"suí","隧":"suì","祟":"suì","孙":"sūn","损":"sǔn","笋":"sǔn","蓑":"suō","梭":"suō","唆":"suō","缩":"suō","琐":"suǒ","索":"suǒ","锁":"suǒ","所":"suǒ","塌":"tā","他":"tā","它":"tā","她":"tā","塔":"tǎ","獭":"tǎ","挞":"tà","蹋":"tà","踏":"tà","胎":"tāi","苔":"tái","抬":"tái","台":"tái","泰":"tai","酞":"tai","太":"tai","态":"tai","汰":"tai","坍":"tān","摊":"tān","贪":"tān","瘫":"tān","滩":"tān","坛":"tán","檀":"tán","痰":"tán","潭":"tán","谭":"tán","谈":"tán","坦":"tǎn","毯":"tǎn","袒":"tǎn","碳":"tàn","探":"tàn","叹":"tàn","炭":"tàn","汤":"tāng","塘":"táng","搪":"táng","堂":"táng","棠":"táng","膛":"táng","唐":"táng","糖":"táng","倘":"tǎng","躺":"tǎng","淌":"tǎng","趟":"tàng","烫":"tàng","掏":"tāo","涛":"tāo","滔":"tāo","绦":"tāo","萄":"táo","桃":"táo","逃":"táo","淘":"táo","陶":"táo","讨":"tǎo","套":"tào","特":"tè","藤":"téng","腾":"téng","疼":"téng","誊":"téng","梯":"tī","剔":"tī","踢":"tī","锑":"tī","提":"tí","题":"tí","蹄":"tí","啼":"tí","体":"tǐ","替":"tì","嚏":"tì","惕":"tì","涕":"tì","剃":"tì","屉":"tì","天":"tiān","添":"tiān","填":"tián","田":"tián","甜":"tián","恬":"tián","舔":"tiǎn","腆":"tiǎn","挑":"tiāo","条":"tiáo","迢":"tiáo","眺":"tiào","跳":"tiào","贴":"tiē","铁":"tiě","帖":"tiē","厅":"tīng","听":"tīng","烃":"tīng","汀":"tīng","廷":"tíng","停":"tíng","亭":"tíng","庭":"tíng","挺":"tǐng","艇":"tǐng","通":"tōng","桐":"tóng","酮":"tóng","瞳":"tóng","同":"tóng","铜":"tóng","彤":"tóng","童":"tóng","桶":"tǒng","捅":"tǒng","筒":"tǒng","统":"tǒng","痛":"tòng","偷":"tōu","投":"tóu","头":"tóu","透":"tòu","凸":"tū","秃":"tū","突":"tū","图":"tú","徒":"tú","途":"tú","涂":"tú","屠":"tú","土":"tǔ","吐":"tǔ","兔":"tù","湍":"tuān","团":"tuán","推":"tuī","颓":"tuí","腿":"tuǐ","蜕":"tuì","褪":"tuì","退":"tuì","吞":"tūn","屯":"tún","臀":"tún","拖":"tuō","托":"tuō","脱":"tuō","鸵":"tuó","陀":"tuó","驮":"tuó","驼":"tuó","椭":"tuǒ","妥":"tuǒ","拓":"tuò","唾":"tuò","挖":"wā","哇":"wa","蛙":"wā","洼":"wā","娃":"wá","瓦":"wǎ","袜":"wà","歪":"wāi","外":"wai","豌":"wān","弯":"wān","湾":"wān","玩":"wán","顽":"wán","丸":"wán","烷":"wán","完":"wán","碗":"wǎn","挽":"wǎn","晚":"wǎn","皖":"wǎn","惋":"wǎn","宛":"wǎn","婉":"wǎn","万":"wàn","腕":"wàn","汪":"wāng","王":"wáng","亡":"wáng","枉":"wǎng","网":"wǎng","往":"wǎng","旺":"wàng","望":"wàng","忘":"wàng","妄":"wàng","威":"wēi","巍":"wēi","微":"wēi","危":"wēi","韦":"wéi","违":"wéi","桅":"wéi","围":"wéi","唯":"wéi","惟":"wéi","为":"wéi","潍":"wéi","维":"wéi","苇":"wěi","萎":"wěi","委":"wěi","伟":"wěi","伪":"wěi","尾":"wěi","纬":"wěi","未":"wèi","蔚":"wèi","味":"wèi","畏":"wèi","胃":"wèi","喂":"wèi","魏":"wèi","位":"wèi","渭":"wèi","谓":"wèi","尉":"wèi","慰":"wèi","卫":"wèi","瘟":"wēn","温":"wēn","蚊":"wén","文":"wén","闻":"wén","纹":"wén","吻":"wěn","稳":"wěn","紊":"wěn","问":"wèn","嗡":"wēng","翁":"wēng","瓮":"wèng","挝":"wō","蜗":"wō","涡":"wō","窝":"wō","我":"wǒ","斡":"wò","卧":"wò","握":"wò","沃":"wò","巫":"wū","呜":"wū","钨":"wū","乌":"wū","污":"wū","诬":"wū","屋":"wū","无":"wú","芜":"wú","梧":"wú","吾":"wú","吴":"wú","毋":"wú","武":"wǔ","五":"wǔ","捂":"wǔ","午":"wǔ","舞":"wǔ","伍":"wǔ","侮":"wǔ","坞":"wù","戊":"wù","雾":"wù","晤":"wù","物":"wù","勿":"wù","务":"wù","悟":"wù","误":"wù","昔":"xī","熙":"xī","析":"xī","西":"xī","硒":"xī","矽":"xī","晰":"xī","嘻":"xī","吸":"xī","锡":"xī","牺":"xī","稀":"xī","息":"xī","希":"xī","悉":"xī","膝":"xī","夕":"xī","惜":"xī","熄":"xī","烯":"xī","溪":"xī","汐":"xī","犀":"xī","檄":"xí","袭":"xí","席":"xí","习":"xí","媳":"xí","喜":"xǐ","铣":"xǐ","洗":"xǐ","系":"xì","隙":"xì","戏":"xì","细":"xì","瞎":"xiā","虾":"xiā","匣":"xiá","霞":"xiá","辖":"xiá","暇":"xiá","峡":"xiá","侠":"xiá","狭":"xiá","下":"xià","厦":"shà","夏":"xià","吓":"xià","掀":"xiān","锨":"xiān","先":"xiān","仙":"xiān","鲜":"xiān","纤":"xiān","咸":"xián","贤":"xián","衔":"xián","舷":"xián","闲":"xián","涎":"xián","弦":"xián","嫌":"xián","显":"xiǎn","险":"xiǎn","现":"xiàn","献":"xiàn","县":"xiàn","腺":"xiàn","馅":"xiàn","羡":"xiàn","宪":"xiàn","陷":"xiàn","限":"xiàn","线":"xiàn","相":"xiāng","厢":"xiāng","镶":"xiāng","香":"xiāng","箱":"xiāng","襄":"xiāng","湘":"xiāng","乡":"xiāng","翔":"xiáng","祥":"xiáng","详":"xiáng","想":"xiǎng","响":"xiǎng","享":"xiǎng","项":"xiàng","巷":"xiàng","橡":"xiàng","像":"xiàng","向":"xiàng","象":"xiàng","萧":"xiāo","硝":"xiāo","霄":"xiāo","削":"xuē","哮":"xiāo","嚣":"xiāo","销":"xiāo","消":"xiāo","宵":"xiāo","淆":"xiáo","晓":"xiǎo","小":"xiǎo","孝":"xiào","校":"xiào","肖":"xiāo","啸":"xiào","笑":"xiào","效":"xiào","楔":"xiē","些":"xiē","歇":"xiē","蝎":"xiē","鞋":"xié","协":"xié","挟":"xiā","携":"xié","邪":"xié","斜":"xié","胁":"xié","谐":"xié","写":"xiě","械":"xiè","卸":"xiè","蟹":"xiè","懈":"xiè","泄":"xiè","泻":"xiè","谢":"xiè","屑":"xiè","薪":"xīn","芯":"xīn","锌":"xīn","欣":"xīn","辛":"xīn","新":"xīn","忻":"xīn","心":"xīn","信":"xìn","衅":"xìn","星":"xīng","腥":"xīng","猩":"xīng","惺":"xīng","兴":"xīng","刑":"xíng","型":"xíng","形":"xíng","邢":"xíng","行":"xíng","醒":"xǐng","幸":"xìng","杏":"xìng","性":"xìng","姓":"xìng","兄":"xiōng","凶":"xiōng","胸":"xiōng","匈":"xiōng","汹":"xiōng","雄":"xióng","熊":"xióng","休":"xiū","修":"xiū","羞":"xiū","朽":"xiǔ","嗅":"xiù","锈":"xiù","秀":"xiù","袖":"xiù","绣":"xiù","墟":"xū","戌":"xū","需":"xū","虚":"xū","嘘":"xū","须":"xū","徐":"xú","许":"xǔ","蓄":"xù","酗":"xù","叙":"xù","旭":"xù","序":"xù","畜":"chù","恤":"xù","絮":"xù","婿":"xù","绪":"xù","续":"xù","轩":"xuān","喧":"xuān","宣":"xuān","悬":"xuán","旋":"xuán","玄":"xuán","选":"xuǎn","癣":"xuǎn","眩":"xuàn","绚":"xuàn","靴":"xuē","薛":"xuē","学":"xué","穴":"xué","雪":"xuě","血":"xuè","勋":"xūn","熏":"xūn","循":"xún","旬":"xún","询":"xún","寻":"xún","驯":"xùn","巡":"xún","殉":"xùn","汛":"xùn","训":"xùn","讯":"xùn","逊":"xùn","迅":"xùn","压":"yā","押":"yā","鸦":"yā","鸭":"yā","呀":"ya","丫":"yā","芽":"yá","牙":"yá","蚜":"yá","崖":"yá","衙":"yá","涯":"yá","雅":"yǎ","哑":"yǎ","亚":"yà","讶":"yà","焉":"yān","咽":"yān","阉":"yān","烟":"yān","淹":"yān","盐":"yán","严":"yán","研":"yán","蜒":"yán","岩":"yán","延":"yán","言":"yán","颜":"yán","阎":"yán","炎":"yán","沿":"yán","奄":"yǎn","掩":"yǎn","眼":"yǎn","衍":"yǎn","演":"yǎn","艳":"yàn","堰":"yàn","燕":"yàn","厌":"yàn","砚":"yàn","雁":"yàn","唁":"yàn","彦":"yàn","焰":"yàn","宴":"yàn","谚":"yàn","验":"yàn","殃":"yāng","央":"yāng","鸯":"yāng","秧":"yāng","杨":"yáng","扬":"yáng","佯":"yáng","疡":"yáng","羊":"yáng","洋":"yáng","阳":"yáng","氧":"yǎng","仰":"yǎng","痒":"yǎng","养":"yǎng","样":"yàng","漾":"yàng","邀":"yāo","腰":"yāo","妖":"yāo","瑶":"yáo","摇":"yáo","尧":"yáo","遥":"yáo","窑":"yáo","谣":"yáo","姚":"yáo","咬":"yǎo","舀":"yǎo","药":"yào","要":"yào","耀":"yào","椰":"yē","噎":"yē","耶":"yē","爷":"yé","野":"yě","冶":"yě","也":"yě","页":"yè","掖":"yè","业":"yè","叶":"yè","曳":"yè","腋":"yè","夜":"yè","液":"yè","一":"yī","壹":"yī","医":"yī","揖":"yī","铱":"yī","依":"yī","伊":"yī","衣":"yī","颐":"yí","夷":"yí","遗":"yí","移":"yí","仪":"yí","胰":"yí","疑":"yí","沂":"yí","宜":"yí","姨":"yí","彝":"yí","椅":"yǐ","蚁":"yǐ","倚":"yǐ","已":"yǐ","乙":"yǐ","矣":"yǐ","以":"yǐ","艺":"yì","抑":"yì","易":"yì","邑":"yì","屹":"yì","亿":"yì","役":"yì","臆":"yì","逸":"yì","肄":"yì","疫":"yì","亦":"yì","裔":"yì","意":"yì","毅":"yì","忆":"yì","义":"yì","益":"yì","溢":"yì","诣":"yì","议":"yì","谊":"yì","译":"yì","异":"yì","翼":"yì","翌":"yì","绎":"yì","茵":"yīn","荫":"yīn","因":"yīn","殷":"yīn","音":"yīn","阴":"yīn","姻":"yīn","吟":"yín","银":"yín","淫":"yín","寅":"yín","饮":"yǐn","尹":"yǐn","引":"yǐn","隐":"yǐn","印":"yìn","英":"yīng","樱":"yīng","婴":"yīng","鹰":"yīng","应":"yīng","缨":"yīng","莹":"yíng","萤":"yíng","营":"yíng","荧":"yíng","蝇":"yíng","迎":"yíng","赢":"yíng","盈":"yíng","影":"yǐng","颖":"yǐng","硬":"yìng","映":"yìng","哟":"yō","拥":"yōng","佣":"yòng","臃":"yōng","痈":"yōng","庸":"yōng","雍":"yōng","踊":"yǒng","蛹":"yǒng","咏":"yǒng","泳":"yǒng","涌":"yǒng","永":"yǒng","恿":"yǒng","勇":"yǒng","用":"yòng","幽":"yōu","优":"yōu","悠":"yōu","忧":"yōu","尤":"yóu","由":"yóu","邮":"yóu","铀":"yóu","犹":"yóu","油":"yóu","游":"yóu","酉":"yǒu","有":"yǒu","友":"yǒu","右":"yòu","佑":"yòu","釉":"yòu","诱":"yòu","又":"yòu","幼":"yòu","迂":"yū","淤":"yū","于":"yú","盂":"yú","榆":"yú","虞":"yú","愚":"yú","舆":"yú","余":"yú","俞":"yú","逾":"yú","鱼":"yú","愉":"yú","渝":"yú","渔":"yú","隅":"yú","予":"yǔ","娱":"yú","雨":"yǔ","与":"yǔ","屿":"yǔ","禹":"yǔ","宇":"yǔ","语":"yǔ","羽":"yǔ","玉":"yù","域":"yù","芋":"yù","郁":"yù","吁":"yù","遇":"yù","喻":"yù","峪":"yù","御":"yù","愈":"yù","欲":"yù","狱":"yù","育":"yù","誉":"yù","浴":"yù","寓":"yù","裕":"yù","预":"yù","豫":"yù","驭":"yù","鸳":"yuān","渊":"yuān","冤":"yuān","元":"yuán","垣":"yuán","袁":"yuán","原":"yuán","援":"yuán","辕":"yuán","园":"yuán","员":"yuán","圆":"yuán","猿":"yuán","源":"yuán","缘":"yuán","远":"yuǎn","苑":"yuàn","愿":"yuàn","怨":"yuàn","院":"yuàn","曰":"yuē","约":"yuē","越":"yuè","跃":"yuè","钥":"yào","岳":"yuè","粤":"yuè","月":"yuè","悦":"yuè","阅":"yuè","耘":"yún","云":"yún","郧":"yún","匀":"yún","陨":"yǔn","允":"yǔn","运":"yùn","蕴":"yùn","酝":"yùn","晕":"yūn","韵":"yùn","孕":"yùn","匝":"zā","砸":"zá","杂":"zá","栽":"zāi","哉":"zāi","灾":"zāi","宰":"zǎi","载":"zǎi","再":"zài","在":"zài","咱":"zán","攒":"zǎn","暂":"zàn","赞":"zàn","赃":"zāng","脏":"zāng","葬":"zàng","遭":"zāo","糟":"zāo","凿":"záo","藻":"zǎo","枣":"zǎo","早":"zǎo","澡":"zǎo","蚤":"zǎo","躁":"zào","噪":"zào","造":"zào","皂":"zào","灶":"zào","燥":"zào","责":"zé","择":"zé","则":"zé","泽":"zé","贼":"zéi","怎":"zěn","增":"zēng","憎":"zēng","曾":"céng","赠":"zèng","扎":"zhā","喳":"zhā","渣":"zhā","札":"zhá","轧":"zhá","铡":"zhá","闸":"zhá","眨":"zhǎ","栅":"shān","榨":"zhà","咋":"zǎ","乍":"zhà","炸":"zhà","诈":"zhà","摘":"zhāi","斋":"zhāi","宅":"zhái","窄":"zhǎi","债":"zhai","寨":"zhai","瞻":"zhān","毡":"zhān","詹":"zhān","粘":"zhān","沾":"zhān","盏":"zhǎn","斩":"zhǎn","辗":"niǎn","崭":"zhǎn","展":"zhǎn","蘸":"zhàn","栈":"zhàn","占":"zhàn","战":"zhàn","站":"zhàn","湛":"zhàn","绽":"zhàn","樟":"zhāng","章":"zhāng","彰":"zhāng","漳":"zhāng","张":"zhāng","掌":"zhǎng","涨":"zhǎng","杖":"zhàng","丈":"zhàng","帐":"zhàng","账":"zhàng","仗":"zhàng","胀":"zhàng","瘴":"zhàng","障":"zhàng","招":"zhāo","昭":"zhāo","找":"zhǎo","沼":"zhǎo","赵":"zhào","照":"zhào","罩":"zhào","兆":"zhào","肇":"zhào","召":"zhào","遮":"zhē","折":"shé","哲":"zhé","蛰":"zhé","辙":"zhé","者":"zhě","锗":"zhě","蔗":"zhè","这":"zhè","浙":"zhè","珍":"zhēn","斟":"zhēn","真":"zhēn","甄":"zhēn","砧":"zhēn","臻":"zhēn","贞":"zhēn","针":"zhēn","侦":"zhēn","枕":"zhěn","疹":"zhěn","诊":"zhěn","震":"zhèn","振":"zhèn","镇":"zhèn","阵":"zhèn","蒸":"zhēng","挣":"zhèng","睁":"zhēng","征":"zhēng","狰":"zhēng","争":"zhēng","怔":"zhēng","整":"zhěng","拯":"zhěng","正":"zhèng","政":"zhèng","帧":"zhēn","症":"zhèng","郑":"zhèng","证":"zhèng","芝":"zhī","枝":"zhī","支":"zhī","吱":"zī","蜘":"zhī","知":"zhī","肢":"zhī","脂":"zhī","汁":"zhī","之":"zhī","织":"zhī","职":"zhí","直":"zhí","植":"zhí","殖":"zhí","执":"zhí","值":"zhí","侄":"zhí","址":"zhǐ","指":"zhǐ","止":"zhǐ","趾":"zhǐ","只":"zhī","旨":"zhǐ","纸":"zhǐ","志":"zhì","挚":"zhì","掷":"zhì","至":"zhì","致":"zhì","置":"zhì","帜":"zhì","峙":"zhì","制":"zhì","智":"zhì","秩":"zhì","稚":"zhì","质":"zhì","炙":"zhì","痔":"zhì","滞":"zhì","治":"zhì","窒":"zhì","中":"zhōng","盅":"zhōng","忠":"zhōng","钟":"zhōng","衷":"zhōng","终":"zhōng","种":"zhǒng","肿":"zhǒng","重":"zhòng","仲":"zhòng","众":"zhòng","舟":"zhōu","周":"zhōu","州":"zhōu","洲":"zhōu","诌":"zhōu","粥":"zhōu","轴":"zhóu","肘":"zhǒu","帚":"zhǒu","咒":"zhòu","皱":"zhòu","宙":"zhòu","昼":"zhòu","骤":"zhòu","珠":"zhū","株":"zhū","蛛":"zhū","朱":"zhū","猪":"zhū","诸":"zhū","诛":"zhū","逐":"zhú","竹":"zhú","烛":"zhú","煮":"zhǔ","拄":"zhǔ","瞩":"zhǔ","嘱":"zhǔ","主":"zhǔ","著":"zhù","柱":"zhù","助":"zhù","蛀":"zhù","贮":"zhù","铸":"zhù","筑":"zhù","住":"zhù","注":"zhù","祝":"zhù","驻":"zhù","抓":"zhuā","爪":"zhǎo","拽":"zhuài","专":"zhuān","砖":"zhuān","转":"zhuǎn","撰":"zhuàn","赚":"zuàn","篆":"zhuàn","桩":"zhuāng","庄":"zhuāng","装":"zhuāng","妆":"zhuāng","撞":"zhuàng","壮":"zhuàng","状":"zhuàng","椎":"zhuī","锥":"zhuī","追":"zhuī","赘":"zhuì","坠":"zhuì","缀":"zhuì","谆":"zhūn","准":"zhǔn","捉":"zhuō","拙":"zhuō","卓":"zhuó","桌":"zhuō","琢":"zhuó","茁":"zhuó","酌":"zhuó","啄":"zhuó","着":"zhe","灼":"zhuó","浊":"zhuó","兹":"zī","咨":"zī","资":"zī","姿":"zī","滋":"zī","淄":"zī","孜":"zī","紫":"zǐ","仔":"zǎi","籽":"zǐ","滓":"zǐ","子":"zǐ","自":"zì","渍":"zì","字":"zì","鬃":"zōng","棕":"zōng","踪":"zōng","宗":"zōng","综":"zōng","总":"zǒng","纵":"zòng","邹":"zōu","走":"zǒu","奏":"zòu","揍":"zòu","租":"zū","足":"zú","卒":"zú","族":"zú","祖":"zǔ","诅":"zǔ","阻":"zǔ","组":"zǔ","钻":"zuàn","纂":"zuǎn","嘴":"zuǐ","醉":"zuì","最":"zuì","罪":"zuì","尊":"zūn","遵":"zūn","昨":"zuó","左":"zuǒ","佐":"zuǒ","柞":"zhà","做":"zuò","作":"zuò","坐":"zuò","座":"zuò"};







function browserType(){
	browserType = {};
	var ua = navigator.userAgent.toLowerCase();
	var s;
	(s = ua.match(/msie ([\d.]+)/)) ? browserType.ie = s[1] :
	(s = ua.match(/firefox\/([\d.]+)/)) ? browserType.firefox = s[1] :
	(s = ua.match(/chrome\/([\d.]+)/)) ? browserType.chrome = s[1] :
	(s = ua.match(/opera.([\d.]+)/)) ? browserType.opera = s[1] :
	(s = ua.match(/version\/([\d.]+).*safari/)) ? browserType.safari = s[1] : 0;
}

var toolbar = new Object();



toolbar.keyboardListener = function(ctrlKey,altKey,shiftKey,otherKey){
	if(getE.error){return;}
	var keyNum = "";
	keyNum += String(ctrlKey?1:0);
	keyNum += String(altKey?1:0);
	keyNum += String(shiftKey?1:0);
	for(var a in toolbar.Function){
		try{toolbar.Function[a].keyTrigger(keyNum+String.fromCharCode(otherKey).toUpperCase());}catch(f){
			//alert(f+":"+a);
		}
		//toolbar.Function[a].keyTrigger(keyNum+String.fromCharCode(otherKey).toUpperCase());
	}
};

toolbar.cookie = new Object();





toolbar.Function = new Object();
















toolbar.Function.textTips = {
	showHTML:function(){
		if(ABTConfig.textTips.functionSwitch){
			return '<input id="texttipsbutton" type="button" value="文字提示" title="文字提示" onclick="toolbar.Function.textTips.mainMethod()" /><!--<input id="pinyinbutton" type="button" value="开启拼音功能" title="开启拼音功能" onclick="toolbar.Function.textTips.pinyinControl()" />-->';
		}
		else{return "";}
	},
	cookieName:"textTips",
	cookieMethod:function(){
		if(ABTConfig.textTips.cookieSwitch&&toolbar.cookie.getCookie(this.cookieName)==1){
			toolbar.Function.textTips.mainMethod();
		}
	},
	resetCookie:function(){toolbar.cookie.setCookie(this.cookieName,0);},
	testTipsState:false,
	pinyinState:false,
	allTextNode:new Array(),
	getTextNode:function(element){
		var childNodes = element.childNodes;
		for (var i=0;i<childNodes.length;i++) {
			var thisChild = childNodes[i];
			switch(thisChild.nodeType){
				case 1:
					this.getTextNode(thisChild);
					break;
				case 3:
					if(this.trim(thisChild.nodeValue).length == 0){break;}
					this.allTextNode.push(thisChild);
					break;
			}
			if(thisChild.nodeName=="IMG"||thisChild.nodeName=="INPUT"||thisChild.nodeName=="OBJECT"||thisChild.nodeName=="SELECT"){this.allTextNode.push(thisChild);}
		}
	},
	AddTag:function(){
		if(this.firstRun){return;}
		for(var a=0;a<this.allTextNode.length;a++){
			var tagNode = document.createElement("i");
			if(this.allTextNode[a].nodeName=="IMG"||this.allTextNode[a].nodeName=="INPUT"||this.allTextNode[a].nodeName=="OBJECT"||this.allTextNode[a].nodeName=="SELECT"){
				tagNode.setAttribute("class","getmessage");
				var newNode = this.allTextNode[a].cloneNode(true);
				tagNode.appendChild(newNode);
			}
			else{	
				var newString = this.allTextNode[a].nodeValue;
				var reg = /[，。！？；、：]/;
				if(reg.exec(newString)==null){
					tagNode.setAttribute("class","getmessage");
					tagNode.innerHTML = newString;
				}
				else{
					tagNode.setAttribute("class","getmainmessage");
					tagNode.innerHTML = this.mySplit(newString,/[，。！？；、：]/);
				}
			}
			
			if(this.allTextNode[a].parentNode){this.allTextNode[a].parentNode.insertBefore(tagNode,this.allTextNode[a]);}
		}
		for(var b=0;b<this.allTextNode.length;b++){
			this.allTextNode[b].parentNode.removeChild(this.allTextNode[b]);
		}
		var allOption = getE.container.getElementsByTagName("option");
		for(var c=0;c<allOption.length;c++){
			var thisMessage = allOption[c].firstChild.cloneNode(true);
			allOption[c].innerHTML = "";
			allOption[c].appendChild(thisMessage);
		}
		this.firstRun = true;

	},
	trim:function(str){return str.replace(/(^\s*)|(\s*$)/g,"");},
	mySplit:function(str,reg){
		var result,x=str,y,zzz=true;
		var stringArray = new Array();
		do{
			result = reg.exec(x);
			if(result!=null){
				var stringIndex = result.index;
				stringArray.push(x.substring(0,stringIndex+1));
				x = x.substring(stringIndex+1);
			}
			else{
				stringArray.push(x);
				zzz = false;
			}
		}
		while(zzz)
		var yy = '<i class="getmessage">';
		for(var a=0;a<stringArray.length;a++){
			yy += (a<stringArray.length-1)?(stringArray[a]+'</i><i class="getmessage">'):(stringArray[a]);
		}
		yy += "</i>";
		return yy;
	},
	getText:function(){
		if(!document.getElementById("gettextmessagecontent")){return;}
		var messagebox = document.getElementById("gettextmessagecontent");
		var textMessage = "";
		if(this.firstChild.nodeName=="IMG"){
			if(this.parentNode.parentNode.nodeName=="A"||this.parentNode.nodeName=="A"){
				textMessage = "图片链接："+getText(this.firstChild);
			}
			else{textMessage = "图片："+getText(this.firstChild);}
		}
		else if(this.firstChild.nodeName=="OBJECT"){textMessage = "媒体："+this.firstChild.getAttribute("title");}
		else if(this.firstChild.nodeName=="SELECT"){textMessage = "下拉菜单";}
		else if(this.firstChild.nodeName=="INPUT"){
			var inputType = this.firstChild.getAttribute("type");
			switch(inputType){
				case "button":
					textMessage = "表单按钮："+this.firstChild.getAttribute("value");
					break;
				case "image":
					textMessage = "图形按钮："+this.firstChild.getAttribute("alt");
					break;
				case "submit":
					textMessage = "提交按钮："+this.firstChild.getAttribute("value");
					break;
				case "reset":
					textMessage = "重置按钮："+this.firstChild.getAttribute("value");
					break;
				case "file":
					textMessage = "文件域："+this.firstChild.getAttribute("title");
					break;
				case "password":
					textMessage = "密码域："+this.firstChild.getAttribute("title");
					break;
				case "radio":
					textMessage = "单选框："+this.firstChild.getAttribute("title");
					break;
				case "checkbox":
					textMessage = "复选框："+this.firstChild.getAttribute("title");
					break;
				case "text":
					textMessage = "文本域："+this.firstChild.getAttribute("title");
					break;
			}
		}
		else if(this.parentNode.parentNode.nodeName=="A"||this.parentNode.nodeName=="A"){
			var thisContent;
			if(this.parentNode.parentNode.nodeName=="A"){
				if(this.parentNode.parentNode.getAttribute("title")){thisContent = this.parentNode.parentNode.getAttribute("title");}
				else{thisContent = this.innerText||this.textContent;}
			}
			else if(this.parentNode.nodeName=="A"){
				if(this.parentNode.getAttribute("title")){thisContent = this.parentNode.getAttribute("title");}
				else{thisContent = this.innerText||this.textContent;}
			}
			textMessage = "链接："+thisContent;
		}
		else if(this.parentNode.nodeName=="H1"||this.parentNode.nodeName=="H2"||this.parentNode.nodeName=="H3"||this.parentNode.nodeName=="H4"||this.parentNode.nodeName=="H5"||this.parentNode.nodeName=="H6"){
			var thisContent = this.innerText||this.textContent;
			textMessage = "标题："+thisContent;
		}
		else{
			var thisContent = this.innerText||this.textContent;
			textMessage = "文本："+thisContent;
		}
		var messageboxWidth = messagebox.offsetWidth;
		var fontRatio = messageboxWidth/textMessage.length;
		//alert(messageboxWidth+"|"+textMessage.length+"|"+fontRatio);
		if(fontRatio<30){
			if(fontRatio>18){
				messagebox.style.fontSize =  parseInt(fontRatio)+"px";
				messagebox.style.lineHeight =  parseInt(fontRatio)+"px";
			}
			if(fontRatio<10){
				messagebox.style.fontSize = parseInt(fontRatio*2)+"px";
				messagebox.style.lineHeight =  parseInt(fontRatio*2)+"px";
			}
		}
		else{messagebox.style.fontSize = "";}
		if(toolbar.Function.textTips.pinyinState){
			textMessage = toolbar.Function.textTips.pinyinText(textMessage);
		}
		messagebox.innerHTML = textMessage;
		textMessage="";
		if(toolbar.Function.textTips.textbgState){
			this.style.backgroundColor = "#F00";
			this.style.color = "#FFF";
		}
	},
	pinyinText:function(text){
		var messayArray = text.split("");
		var newString = "";
		for(var a=0;a<messayArray.length;a++){
			var testVar = "";
			if(pinyin[messayArray[a]]){testVar = pinyin[messayArray[a]];}
			else{testVar = "&nbsp;";}
			if(messayArray[a]==" "){messayArray[a]="&nbsp;";}
			newString += "<span>"+messayArray[a]+"<sup>"+testVar+"</sup></span>";
		}
		return newString;
	},
	getEvent:function(){
		var allSpan = getE.container.getElementsByTagName("i");
		for(var c=0;c<allSpan.length;c++){
			if(allSpan[c].getAttribute("class")=="getmessage"){
				allSpan[c].onmouseover = this.getText;
				allSpan[c].onmouseout = this.clearTextbg;
			}
		}
	},
	pinyinControl:function(){
		this.pinyinState = this.pinyinState?false:true;
		if(this.pinyinState){document.getElementById("pinyinbuttonbox").firstChild.innerHTML = "关闭拼音功能";}
		else{document.getElementById("pinyinbuttonbox").firstChild.innerHTML = "开启拼音功能";}
	},
	firstRun:false,
	textbgState:false,
	textbg:function(){
		this.textbgState = this.textbgState?false:true;
		document.getElementById("textbgbuttonbox").getElementsByTagName("a")[0].innerHTML = this.textbgState?"关闭标记功能":"开启标记功能";
	},
	clearTextbg:function(){
		this.style.backgroundColor = "";
		this.style.color = "";
	},
	mainMethod:function(){
		if(!ABTConfig.textTips.functionSwitch||getE.error){return;};
		if(!this.textGetState){
			var newMessageBox = document.createElement("div");
			newMessageBox.setAttribute("id","gettextmessagebox");
			newMessageBox.innerHTML = '<div id="closetextmessagebox"><a href="javascript:" onclick="toolbar.Function.textTips.mainMethod()"></a></div><div id="textbgbuttonbox"><a href="javascript:" onclick="toolbar.Function.textTips.textbg()">开启标记功能</a></div><div id="pinyinbuttonbox"><a href="javascript:" onclick="toolbar.Function.textTips.pinyinControl()">开启拼音功能</a></div><div id="gettextmessagecontent"></div>';
			document.body.insertBefore(newMessageBox,getE.container);
			document.body.style.paddingBottom = 140+"px";
			document.getElementById("pinyinbuttonbox").firstChild.focus();
			this.getTextNode(getE.container);
			this.AddTag();
			this.getEvent();
			this.textGetState = true;
		}
		else{
			document.body.removeChild(document.getElementById("gettextmessagebox"));
			document.body.style.paddingBottom = 0+"px";
			this.textGetState = false;
		}
		toolbar.cookie.setCookie(this.cookieName,this.textGetState?1:0);
	}
};






eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('1a 19(){3=9 18();3.16=6;3.A="A";3.17="1b";3.d=6;3.1c=1g;3.s={};3.s.8=6;3.s.u=9 b("G:已跳转到头部内容区域:7+K","x:已跳转到主要内容区域:7+C","x:已跳转到主要内容区域:7+a+C","H:已跳转到中间内容区域:7+M","H:已跳转到中间内容区域:a+7+c+M","D:已跳转到左侧内容区域:7+L","y:已跳转到左侧内容区域:7+L","D:已跳转到左侧内容区域:a+7+c+L","y:已跳转到左侧内容区域:a+7+c+L","E:已跳转到右侧内容区域:7+R","F:已跳转到右侧内容区域:7+R","E:已跳转到右侧内容区域:a+7+c+R","F:已跳转到右侧内容区域:a+7+c+R","I:已跳转到底部内容区域:7+B","I:已跳转到底部内容区域:a+7+c+B");3.h={};3.h.8=6;3.h.13=9 b("a+z","7+z");3.h.W=9 b("U+o+z","p+o+z");3.h.u=9 b("k:X:网站标志","k:12:一级栏目分组","k:1i:二级栏目分组","k:10:三级栏目分组","k:Z:四级栏目分组","1e:G:头部栏目分组");3.g={};3.g.d=6;3.g.8=6;3.g.1B=9 b("p+o+j");3.g.1A="/无障碍辅助浏览工具条（第三版）/1z/g.1y";3.f={};3.f.d=6;3.f.8=6;3.f.J=0.2;3.f.v=2;3.f.N=1;3.e={};3.e.d=6;3.e.8=6;3.e.J=4;3.e.v=1v;3.e.N=14;3.m={};3.m.T=6;3.m.8=6;3.m.u=9 b("#q|#w|黑白对比度","#q|#1k|白紫对比度","#w|#1p|黑蓝对比度","#1u|#q|红白对比度");3.n={};3.n.d=6;3.n.8=6;3.n.1q=5;3.i={};3.i.d=6;3.i.8=6;3.i.11=6;3.i.1r="1s/1t.1o";3.t={};3.t.8=6;3.t.1j="1l://1w.1F.1E.1D:1x/1C/1n.Y";3.Q={};3.Q.8=6;3.l={};3.l.T=6;3.l.8=6;3.l.V=9 b("p+j");3.1h=0;3.r=9 b();3.r[0]={S:"默认样式",O:1d,P:"15"};3.r[1]={S:"白色样式",O:1f,P:"1m"}}',62,104,'|||ABTConfig|||true|Alt|functionSwitch|new|Ctrl|Array|Shift|cookieSwitch|fontZoom|pageZoom|textMode|customSkip|textTips||tagName|show|hightContrast|guides|shift|alt|FFF|skin|areaSkip|help|delimit|Max|000|content|leftcolumn||container|||leftsidebar|rightsidebar|rightcolumn|header|main|footer|onceZoom||||Min|bodyPadding|folder|resetToolbar||name|cookieSwtich|ctrl|keyCode|previousKeyCode|H1|html|H5|H4|pinyinSwitch|H2|nextKeyCode||default|mainSwitch|skipClassName|Object|declareConfig|function|skipelement|cookieTime|33|tagId|71|30|defaultSkin|H3|dataFileURL|93F|http|white|helpContent|js|09F|skew|pinyinFileURL|script|ku|F00|28|192|8700|css|styles|styleFileURL|KeyCode|toolbarhelp|140|170|168'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('4 h(){5 3=g.o("j").k("u");a="";2(3.q("/")!=-1){a=3.s(0,3.t("/")+1)}d{a=""}}h();2(6.i){6.i("r",7,f)}d{6.p("n",7)}5 b=f;4 7(){b=l;m();2(9.v){F();J(9.I);w();c.H=9.K;c.L.O()}}g.N=4 M(e){2(!b){G}5 8=0,e=e||z;8=e.x||e.A||e.B;c.E(e.D,e.C,e.y,8)};',51,51,'||if|ABTFileUrl|function|var|window|Initialization|currkey|ABTConfig|URLPrefix|pageLoaded|toolbar|else||false|document|loadConfig|addEventListener|ABT|getAttribute|true|declareConfig|onload|getElementById|attachEvent|indexOf|load|substring|lastIndexOf|src|mainSwitch|iframeKeyListenerWrite|keyCode|shiftKey|event|which|charCode|altKey|ctrlKey|keyboardListener|browserType|return|skin|container|getElements|defaultSkin|cookie|keyListener|onkeydown|readCookie'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('7 Z(q){2=Y U();8(5.A(q)){2.j=5.A(q);2.V=2.j.9("*");2.W=2.j.9("T");2.s=2.j.9("Q");2.R=5.9("z")[0].9("S");2.w=X}g{2.w=13}}7 14(c){6 b="";b+=r(c.f().t("11")>-1?1:0);b+=r(c.f().t("P")>-1?1:0);b+=r(c.f().t("10")>-1?1:0);b+=c.f().15(c.f().O("+")+1);n b}7 M(3,4){8(!3){n}6 d=5.y("G");d.E("N",L.K);d.H.I="J:o;B:o;12-1m:o;1s-B:o;";d.1t=\'<a 1r="C:" h="\'+4+\'" 1q="x(1o)">\'+4+"</a>";3.l.1p(d,3);d.1v.1z()}7 x(v){v.l.l.16(v.l)}7 1x(3){6 4;8(3.D=="#u"){4=1w.1y}g 8(3.D=="1u"){8(3.k("F")){4=3.k("F")}g 8(3.k("h")){4=3.k("h")}g{4=5.h}}g{4=3.1n||3.1c}n 4}7 1d(){8(2.w){n}1b(6 i=0;i<2.s.1a;i++){6 p=2.s[i].17;18{6 m=p.5.y("19");m.E("1e","u/C");m.u="5.1f = 7(e){6 e=e||1k;5.1l.1j.1i(e);}";p.5.9("z")[0].1g(m)}1h(e){}}}',62,98,'||getE|element|elementText|document|var|function|if|getElementsByTagName||thisKeyString|keyString|shipElement||toUpperCase|else|title||container|getAttribute|parentNode|scriptElement|return|0px|iframeDOM|elementId|String|allFrame|indexOf|text|skipElement|error|skipElementRemove|createElement|head|getElementById|height|javascript|nodeName|setAttribute|alt|div|style|cssText|width|skipClassName|ABTConfig|skipElementBuild|class|lastIndexOf|ALT|iframe|allStyle|link|img|Object|allElements|allImg|false|new|getElements|SHIFT|CTRL|font|true|keyCodeStringHandle|substring|removeChild|contentWindow|try|script|length|for|textContent|iframeKeyListenerWrite|type|onkeydown|appendChild|catch|keyListener|parent|event|parentWindow|size|innerText|this|insertBefore|onblur|href|line|innerHTML|IMG|firstChild|thisElement|getText|nodeValue|focus'.split('|')))
eval(function(p,a,c,k,e,d){while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+c.toString(a)+'\\b','g'),k[c])}}return p}('c.6.d=b(2,1){e(2==4||1==4){9}5 7=8.a;5 0=o l();0.m(0.f()+7*k*3*3*j);g.6=2+"="+h(1)+";i="+0.n()};',25,25,'exp|cookieValue|cookieName|60|undefined|var|cookie|Days|ABTConfig|return|cookieTime|function|toolbar|setCookie|if|getTime|document|escape|expires|1000|24|Date|setTime|toGMTString|new'.split('|')))
eval(function(p,a,c,k,e,d){while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+c.toString(a)+'\\b','g'),k[c])}}return p}('7.5.9=a(1){6(1==8){3}b 0=e.5.g(c f("(^| )"+1+"=([^;]*)(;|$)"));6(0!=4)3 d(0[2]);3 4};',17,17,'arr|name||return|null|cookie|if|toolbar|undefined|getCookie|function|var|new|unescape|document|RegExp|match'.split('|')))
eval(function(p,a,c,k,e,d){while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+c.toString(a)+'\\b','g'),k[c])}}return p}('0.6.9=7(){5(!2.3||4.8){i}b(h a g 0.1){f{0.1[a].c()}d(e){}}};',19,19,'toolbar|Function|ABTConfig|cookieSwitch|getE|if|cookie|function|error|readCookie||for|cookieMethod|catch||try|in|var|return'.split('|')))
eval(function(p,a,c,k,e,d){while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+c.toString(a)+'\\b','g'),k[c])}}return p}('9.e.4={k:c(g){6 3=f.4.q;i(6 a=0;a<3.h;a++){d(g==j(3[a].5(":")[2])){9.e.4.7(3[a].5(":")[0],3[a].5(":")[1])}}},7:c(b,8){d(!f.4.n){l};m(p.o(b),8)}};',27,27,'|||customizeAreaSkip|areaSkip|split|var|mainMethod|elementText|toolbar||areaId|function|if|Function|ABTConfig|keyString|length|for|keyCodeStringHandle|keyTrigger|return|skipElementBuild|functionSwitch|getElementById|document|delimit'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('p.o.c={I:l(k){6 j=f.c.j;6 i=f.c.i;h(6 a=0;a<j.8;a++){4(k==A(j[a])){p.o.c.r(0)}};h(6 a=0;a<i.8;a++){4(k==A(i[a])){p.o.c.r(1)}}},w:l(){6 q=f.c.D;6 m=B C();6 n=0;h(6 a=0;a<e.g.8;a++){h(6 b=0;b<q.8;b++){6 9=q[b].G(":");4((9[0]=="K"&&e.g[a].Q==9[1])||(9[0]=="x"&&e.g[a].O("J")==9[1])){m[n]={t:e.g[a],z:9[2],y:9[0]};n++}}}s m},v:L,7:B C(),5:-1,r:l(u){4(!f.c.N){s};4(3.v){3.7=3.w();3.v=P}4(u==0){3.5++;4(3.5>3.7.8-1){3.5=3.7.8-1}}M 4(u==1){3.5--;4(3.5<0){3.5=0}}4(3.7.8==0){s}6 d="";4(3.7[3.5].y!="x"){d=F(3.7[3.5].t);4(d==H){d=""}}d+=3.7[3.5].z;E(3.7[3.5].t,d)}};',53,53,'|||this|if|nowElementNum|var|customElementGroup|length|tempVar|||customSkip|nodeText|getE|ABTConfig|allElements|for|previousKeyCode|nextKeyCode|keyString|function|allCustomElement|allColumnNum|Function|toolbar|switchValue|mainMethod|return|element|skipDirection|firstRun|getCustomSkip|tagId|elementType|elementTips|keyCodeStringHandle|new|Array|delimit|skipElementBuild|getText|split|undefined|keyTrigger|id|tagName|true|else|functionSwitch|getAttribute|false|nodeName'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('6.r.5={Y:h(){e(m.5.K){3 w=4.7?"切换回默认模式":"纯文本模式浏览";D\'<10 L="x" W="Z" R="\'+w+\'" 1d="\'+w+\'" 1a="6.r.5.o()" />\'}O{D""}},19:h(U){3 E=m.5.15;j(3 a=0;a<E.8;a++){e(U==16(E[a])){6.r.5.o()}}},l:"7",1c:h(){e(m.5.18&&6.q.17(4.l)==1){6.r.5.o()}},14:h(){6.q.F(4.l,0)},7:T,o:h(){e(!m.5.K||2.1e){D};e(!4.7){2.Q.B.P="13";j(3 c=0;c<2.g.8;c++){3 G=2.g[c].1b;3 u=f.t("1f");12{u.y=G.f.11.y}X(z){}2.g[c].n.H(u,2.g[c])}I(2.g.8){2.g[0].n.J(2.g[0])}j(3 d=0;d<2.9.8;d++){3 A=f.t("1y");A.y=1x(2.9[d]);2.9[d].n.H(A,2.9[d])}I(2.9.8){2.9[0].n.J(2.9[0])}3 M="1w://1v.1A.1z.1C/1D/1g/1B/5.V";j(3 a=0;a<2.v.8;a++){e(2.v[a].1u("L")!="1l"){2.v[a].k("p","#")}}3 i=f.t("1k");i.k("1j","1h");i.k("W","1i/V");i.k("p",M);f.1m("1n")[0].1s(i);j(3 b=0;b<2.N.8;b++){2.N[b].B.1r=1q};e(f.S("x")){f.S("x").k("R","切换回默认模式")};2.Q.B.P="1o";4.7=1p;6.q.F(4.l,4.7?1:0)}O{4.7=T;6.q.F(4.l,4.7?1:0);C.s.p=C.s.p;C.s.1t()}}};',62,102,'||getE|var|this|textMode|toolbar|textModeState|length|allImg|||||if|document|allFrame|function|textModeStyle|for|setAttribute|cookieName|ABTConfig|parentNode|mainMethod|href|cookie|Function|location|createElement|newFrameContainer|allStyle|buttonText|textmodebutton|innerHTML||newImgContainer|style|window|return|shortcuts|setCookie|iframeDOM|insertBefore|while|removeChild|functionSwitch|id|textModeStyleUrl|allElements|else|display|container|value|getElementById|false|keyString|css|type|catch|showHTML|button|input|body|try|none|resetCookie|KeyCode|keyCodeStringHandle|getCookie|cookieSwitch|keyTrigger|onclick|contentWindow|cookieMethod|title|error|div|phpmd5|stylesheet|text|rel|link|ABTStyle|getElementsByTagName|head|block|true|null|height|appendChild|reload|getAttribute|221|http|getText|span|141|208|ABT|145|content'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('h.y.6={11:v(){5(b.6.G){u\'<P N="X" U="O" M="页面放大" W="页面放大" V="h.y.6.w(1)" /><P N="16" U="O" M="页面缩小" W="页面缩小" V="h.y.6.w(0)" />\'}i{u""}},s:"4",Y:v(){5(!b.6.Z){u}c x=h.E.14(3.s);5(x>1){x-=b.6.D;3.4=x;h.y.6.w(1)}},12:v(){h.E.R(3.s,1)},4:1,13:15,w:v(l){5(!b.6.G||9.17){u};5(l==1){3.4=(3.4*10+b.6.D*10)/10;5(3.4>b.6.T){3.4=b.6.T}}i 5(l==0){3.4=(3.4*10-b.6.D*10)/10;5(3.4<b.6.H){3.4=b.6.H}}c 8=9.a.q;c r=9.a.1m;9.a.7.S="1l";5(n.1k){5(d.e.q>8*3.4){9.a.7.t="I:J;K:1j%;L:B;";9.a.7.1o=0-f.g(8*3.4/2)+"j"}i{9.a.7.t="I:J;K:B;L:B;"}9.a.7.1q=3.4}i{c 1p=f.g(((8*3.4-8)/3.4)/2);c Q=f.g(((r*3.4-r)/3.4)/2);c p;5(8*3.4>d.e.q){c F=(8*3.4-d.e.q)/2;p=f.g(F/3.4)}i{p=0}c k="";5(n.1n){k="-1h-"};5(n.18||n.1b){k="-1i-";d.e.7.1a=f.g(r*3.4)+"j";c z;c A=d.e.q;5(A<8*3.4&&l==1){z=f.g((8*3.4-A)/3.4);d.e.7.m=f.g(8*3.4)+"j";p-=z/2}5(l==0){5(19.m>8*3.4){d.e.7.m=C}i{d.e.7.m=f.g(8*3.4)+"j"}}}5(n.1c){k="-o-"};9.a.7.t=k+"1d:1g("+3.4+") 1f("+p+"j,"+Q+"j);"}5(3.4==1){9.a.7.t=C;d.e.7.m=C}9.a.7.S="1e";h.E.R(3.s,3.4)}};',62,89,'|||this|pageZoomState|if|pageZoom|style|containerWidth|getE|container|ABTConfig|var|document|body|Math|round|toolbar|else|px|hackCSS|zoomMode|width|browserType||boxTranslate|offsetWidth|containerHeight|cookieName|cssText|return|function|mainMethod|cookieValue|Function|bodyWidth|oldBodyWidth|0px|null|onceZoom|cookie|fuck|functionSwitch|Min|position|absolute|left|margin|value|id|button|input|containerY|setCookie|display|Max|type|onclick|title|pagezoomin|cookieMethod|cookieSwitch||showHTML|resetCookie|firstRun|getCookie|true|pagezoomout|error|chrome|screen|height|safari|opera|transform|block|translate|scale|moz|webkit|50|ie|none|offsetHeight|firefox|marginLeft|containerX|zoom'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('8.b.5={F:d(){7(6.5.x){f\'<u v="G" w="t" s="文字放大" o="文字放大" p="8.b.5.g(1)" /><u v="E" w="t" s="文字缩小" o="文字缩小" p="8.b.5.g(0)" I="8.b.J.P(1)" />\'}m{f""}},e:"4",O:d(){7(!6.5.M){f}A i=8.n.N(3.e);7(i!=0){3.4=i-6.5.j;8.b.5.g(1)}},L:d(){8.n.y(3.e,0)},4:0,g:d(k){7(!6.5.x||9.H){f};7(3.4==0){3.4=6.5.l}7(k==1){3.4+=6.5.j;7(3.4>6.5.C){3.4=6.5.C}}m 7(k==0){3.4-=6.5.j;7(3.4<6.5.l){3.4=0}}D(A a=0;a<9.c.K;a++){7(3.4>6.5.l){9.c[a].h.B=3.4+"z";9.c[a].h.r=(3.4+2)+"z"}m{9.c[a].h.B=q;9.c[a].h.r=q}}8.n.y(3.e,3.4)}};',52,52,'|||this|fontZoomState|fontZoom|ABTConfig|if|toolbar|getE||Function|allElements|function|cookieName|return|mainMethod|style|cookieValue|onceZoom|zoomMode|Min|else|cookie|title|onclick|null|lineHeight|value|button|input|id|type|functionSwitch|setCookie|px|var|fontSize|Max|for|fontzoomout|showHTML|fontzoomin|error|onfocus|hightContrast|length|resetCookie|cookieSwitch|getCookie|cookieMethod|openMenu'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('5.f.4={15:p(){8(t.4.11){3 n=\'<R I="14"><13 I="1a" 18="1c" 16="高对比度" 1b="高对比度" O="5.f.4.m(0)" T="5.f.4.m(1)" 19="5.f.4.m(0)" /><P I="L" O="5.f.4.m(0)" T="5.f.4.m(1)" 6="K:J;">\';n+=\'<w><a Q="12:5.f.4.A(-1)">还原对比度</a></w>\';3 h=t.4.Z;j(3 a=0;a<h.k;a++){n=n+\'<w 6="17-y:\'+h[a].u("|")[1]+\';"><a Q="12:5.f.4.A(\'+a+\')" 6="y:\'+h[a].u("|")[0]+\';">\'+h[a].u("|")[2]+"</a></w>"}n+="</P></R>";x n}D{x""}},E:"1j",1i:p(){8(!t.4.1g){x}3 H=5.M.1e(9.E);8(H!=-1){5.f.4.A(H)}},1d:p(){5.M.S(9.E,-1)},m:p(o){8(o==0){G.N("L").6.K="1h"}D 8(o==1){G.N("L").6.K="J"}},i:p(l,o,q,b){8(o==0){l.6.W="";l.6.V="";l.6.y=""}D 8(o==1){l.6.W=b;l.6.V="J";l.6.y=q}},A:p(s){8(!t.4.11||7.1f){x};3 h=t.4.Z;8(s!=-1){3 v=h[s].u("|")[0];3 z=h[s].u("|")[1];j(3 b=0;b<7.F.k;b++){9.i(7.F[b],1,v,z)}j(3 c=0;c<7.B.k;c++){3 C=7.B[c].Y;X{3 g=C.G.r("10")[0];9.i(g,1,v,z);j(3 d=0;d<g.r("*").k;d++){9.i(g.r("*")[d],1,v,z)}}U(e){}}}D{j(3 b=0;b<7.F.k;b++){9.i(7.F[b],0)}j(3 c=0;c<7.B.k;c++){3 C=7.B[c].Y;X{3 g=C.G.r("10")[0];9.i(g,0);j(3 d=0;d<g.r("*").k;d++){9.i(g.r("*")[d],0)}}U(e){}}}5.M.S(9.E,s)}};',62,82,'|||var|hightContrast|toolbar|style|getE|if|this||||||Function|iframeBody|contrastlist|contrastControl|for|length|element|openMenu|hightContrastHTML|mode|function||getElementsByTagName|colorNum|ABTConfig|split|qcolor|li|return|color|bcolor|mainMethod|allFrame|iframeDOM|else|cookieName|allElements|document|cookieValue|id|none|display|hightcontrastlist|cookie|getElementById|onmouseover|ul|href|div|setCookie|onmouseout|catch|backgroundImage|backgroundColor|try|contentWindow|delimit|body|functionSwitch|javascript|input|hightcontrast|showHTML|value|background|type|onfocus|hightcontrastbutton|title|button|resetCookie|getCookie|error|cookieSwtich|block|cookieMethod|hightContrastState'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('9.q.4={V:g(){5(8.4.G){x t=6.a?"关闭辅助线":"开启辅助线";j\'<U n="7" T="W" A="\'+t+\'" C="\'+t+\'" 10="9.q.4.B()" Z="9.q.S.11(1)" />\'}z{j""}},h:"a",P:g(){5(8.4.M&&9.u.N(6.h)==1){9.q.4.B()}},Q:g(){9.u.H(6.h,0)},a:F,B:g(){5(!8.4.G){j};5(!6.a){x k=2.L("d");k.c("n","i");k.Y=\'<d n="f"></d><d n="p"></d>\';2.l.12(k,1e.1f);2.3("p").b.1i=2.l.1h+"y";2.3("f").b.D="#E";2.3("p").b.D="#E";5(2.3("7")){2.3("7").c("A","关闭辅助线")}5(2.3("7")){2.3("7").c("C","关闭辅助线")}2.1b=6.w;v.1a=6.w;6.a=15}z{2.3("i").14.13(2.3("i"));5(2.3("7")){2.3("7").c("A","开启辅助线")}5(2.3("7")){2.3("7").c("C","开启辅助线")}6.a=F}9.u.H(6.h,6.a?1:0)},w:g(e){5(!2.3("i")){j}e=v.J?v.J:e;x r,s;2.3("f").b.I="18";5(19.17){r=e.16+8.4.m;s=e.1g+(2.K.o||2.l.o)+8.4.m}z{2.3("f").b.I="1c";r=e.1d+8.4.m;s=e.R-(2.K.o||2.l.o)+8.4.m}2.3("p").b.O=r+"y";2.3("f").b.X=s+"y"}};',62,81,'||document|getElementById|guides|if|this|guidesbutton|ABTConfig|toolbar|guidesState|style|setAttribute|div||guidesXLine|function|cookieName|guidesbox|return|newGuidesBox|body|skew|id|scrollTop|guidesYLine|Function|guidesX|guidesY|guidesValue|cookie|window|moveGuides|var|px|else|value|mainMethod|title|backgroundColor|F00|false|functionSwitch|setCookie|position|event|documentElement|createElement|cookieSwitch|getCookie|left|cookieMethod|resetCookie|pageY|hightContrast|type|input|showHTML|button|top|innerHTML|onfocus|onclick|openMenu|insertBefore|removeChild|parentNode|true|clientX|ie|absolute|browserType|onscroll|onmousemove|fixed|pageX|getE|container|clientY|offsetHeight|height'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('7.8.4={y:i(){b(l.4.m){e\'<D 3="G" B="A" C="帮助" c="帮助" j="7.8.4.9()" />\'}q{e""}},5:k,9:i(){b(!l.4.m){e};b(!d.5){t 6=2.s("1");6.r("3","h");6.n=\'<1 3="u">无障碍辅助浏览工具条</1><1 3="g"></1><1 3="v"><a x="w:" j="7.8.4.9()" c="关闭帮助"></a></1>\';2.f.Y(6,2.f.W);2.p("g").n=\'<o 3="J" I="\'+\'L://M.P.O.N/E/K/Q/R.X" V="0" U="S" T="0" H="0" c="帮助内容"></o>\';d.5=z}q{2.f.F(2.p("h"));d.5=k}}};',61,61,'|div|document|id|help|helpBoxState|newHelpBox|toolbar|Function|mainMethod||if|title|this|return|body|helpcontent|abthelpbox|function|onclick|false|ABTConfig|functionSwitch|innerHTML|iframe|getElementById|else|setAttribute|createElement|var|helptitle|closehelpbox|javascript|href|showHTML|true|button|type|value|input|content|removeChild|ABTHelpbutton|marginwidth|src|helpcontentbox|phpmd5|http|221|145|141|208|ABT|helpContent|auto|marginheight|scrolling|frameborder|firstChild|html|insertBefore'.split('|')))
eval(function(p,a,c,k,e,d){while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+c.toString(a)+'\\b','g'),k[c])}}return p}('0.1.2={h:6(){4(7.2.8){3\'<i j="g" f="9" b="重置" c="重置" d="0.1.2.5()" />\'}k{3""}},5:6(){4(!7.2.8){3};m(n a o 0.1){s{0.1[a].q()}t(e){}};r.l.p()}};',30,30,'toolbar|Function|resetToolbar|return|if|mainMethod|function|ABTConfig|functionSwitch|button||value|title|onclick||type|resetbutton|showHTML|input|id|else|location|for|var|in|reload|resetCookie|window|try|catch'.split('|')))
eval(function(p,a,c,k,e,d){e=function(c){return(c<a?'':e(parseInt(c/a)))+((c=c%a)>35?String.fromCharCode(c+29):c.toString(36))};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('4.f.8={B:k(){7(b.8.A){u\'<17 v="11" D="1b" 1j="关闭" w="关闭" 1a="4.f.8.o()" />\'}K{u""}},Q:k(M){6 s=b.8.X;C(6 a=0;a<s.V;a++){7(M==U(s[a])){4.f.8.o()}}},q:"i",O:k(){7(b.8.P&&4.t.W(c.q)==1){4.f.8.o()}},T:k(){4.t.J(c.q,1)},i:I,o:k(){7(!b.8.A){u};7(!c.i){7(!3.9("x")){6 h=3.z("Z");h.m("S","N");h.m("D","R/y");h.m("v","x");h.m("Y",1l+"1f/"+b.d[4.d].1e+"/d.y");3.1d("1c")[0].1g(h)}6 r="";C(6 a 1h 4.f){1k{r=r+4.f[a].B()}1i(e){}};6 p=3.z("10");p.m("v","n");p.14=r;3.g.13(p,3.g.j);6 l=3.9("n").12;l=l>(b.d[4.d].E*2.1)?l:b.d[4.d].E;3.g.G.L=l+"15";F(3.9("n").j,"无障碍辅助工具条已开启");7(3.9(\'5\')){6 5=3.9(\'5\');5.j.H=\'关闭辅助工具条\';5.w="关闭辅助工具条"}c.i=16}K{3.g.19(3.9("n"));3.g.G.L="18";F(3.g.j,"无障碍辅助工具条已关闭");7(3.9(\'5\')){6 5=3.9(\'5\');5.j.H=\'开启辅助工具条\';5.w="开启辅助工具条"}c.i=I}4.t.J(c.q,c.i?1:0)}};',62,84,'|||document|toolbar|aa|var|if|show|getElementById||ABTConfig|this|skin||Function|body|toolbarStyleElement|toolbarState|firstChild|function|toobarHeight|setAttribute|ABTToolbar|mainMethod|newToolbar|cookieName|toolbarHTML|shortcuts|cookie|return|id|title|ABTStyle|css|createElement|functionSwitch|showHTML|for|type|bodyPadding|skipElementBuild|style|nodeValue|false|setCookie|else|paddingTop|keyString|stylesheet|cookieMethod|cookieSwtich|keyTrigger|text|rel|resetCookie|keyCodeStringHandle|length|getCookie|keyCode|href|link|div|closetoolbar|offsetHeight|insertBefore|innerHTML|px|true|input|0px|removeChild|onclick|button|head|getElementsByTagName|folder|skins|appendChild|in|catch|value|try|URLPrefix'.split('|')))























